<template>
  <div id="app">
    <Indicator color="#EF4326" />
    <HeadBar buttonColor="#ACABAB">
      <div class="hbutton" data-target="1">偏鄉就醫有多苦</div>
			<div class="hbutton" data-target="2">你的家鄉安寧嗎</div>
			<div class="hbutton" data-target="3">醫生病人相對論</div>
    </HeadBar>
    <Cover :src="bg" :srcWeb="bg_web">
      <div id="cover-contain">
        <h1>相同健保費，<span class="hidden-md hidden-lg"><br/></span>看病命運大不同</h1>
        <div class="sub-title">地圖看台灣醫療資源</div>
        <div class="title-button"><i class="fa fa-angle-down"></i></div>
      </div>
      <div id="cover-icon">
        <img src="./assets/pill.png">
      </div>
    </Cover>
    <div :style="{backgroundImage:bg}" ></div>
    <ContentContainer>
      <div id="cover-text">
        <p>台灣醫療資源分配不均問題嚴重，但是從政府官方數據卻無法看出急迫性。根據<a target="_blank" href="https://dep.mohw.gov.tw/DOS/np-3050-113.html">衛福部醫療服務量統計資料</a>，嘉義市醫療資源最充足，其次是花蓮縣和台北市。</p>
        <p><br/></p>
        <p>花蓮縣贏過都會區讓人詫異，《聯合報》團隊諮詢專家、偏鄉醫生，撈出大量官方數據並且比對地圖，發現花蓮部分鄉鎮醫療資源嚴重不均，居民要找到醫生、藥局，難如登天。更多縣市期待臨終最後一哩路能好好走，安寧資源卻像沙漠般匱乏。</p>
        <p><br/></p>
        <p>偏鄉老年人口多，他們繳一樣的健保費卻無法享有相同的醫療資源。要滿足偏鄉醫療需求，需要的或許不是大醫院，而是能就近領藥、生病時有地方求助的安心所在。</p>
      </div>
      <br/>
      <Share href="https://udn.com/upf/newmedia/2018_data/rural_medical/index.html" />
      <br/>
    </ContentContainer>
    <Section id="section-1" :src="section1" :srcWeb="section1_web" text="政府說醫療資源充足，你相信嗎？"/>
    <div id="map-contain">
      <div id="map-say" :class="{show: mapSayShow}">
        <span class="circle2" :class="{hidden: mapMarkHidden2}"></span><span :class="{hidden: mapMarkHidden2}">{{mapmarks}}<br/></span><span class="circle" :class="{hidden: mapMarkHidden}"></span><span id="mapmark">{{mapmark}}</span><br/><br/>{{mapsay}}<br/>{{mapsource}}<br/>{{mapremark}}
      </div>
      <ContentContainer id="map-content" :class="{show: mapShow}">
        <h2 class="hidden-md hidden-lg">{{mapcontent}}</h2>
      </ContentContainer>
      <div id="map-menu" :class="{open: mapmenu}">
        <div class="item" @click="menuClick(index)" v-for="(item, index) in main" :key="item.id">{{item.location}}</div>
      </div>
      <div id="map-tooltip" :class="{show: tooltipShow}">
        <div class="tooltip-title">{{selectedCountry.location}}</div>
        <div id="tooltip-detail">
          <div class="detail">人口數<span>{{selectedCountry.population}}人</span></div>
          <div class="detail">老年人口數<span>{{selectedCountry.old}}人</span></div>
          <div class="detail">醫院總數<span>{{selectedCountry.hospital}}家</span></div>
          <div class="detail">每萬人口病床數<span>{{selectedCountry.beds}}床</span></div>
          <div class="detail noborder">每萬人口執業醫事人口數<span>{{selectedCountry.employee}}人</span></div>
        </div>
      </div>
      <div id="map-tooltip-s" :class="{show: tooltipShow2}">
        <div class="tooltip-title">{{selectedCountry.location}}</div>
        <div id="tooltip-detail-s">
          <div class="detail">老年人口數<span>{{selectedCountry.old}}人</span></div>
          <div class="detail">105年度癌症死亡人口<span>{{selectedCountry.cancer}}人</span></div>
          <div class="detail">多少零安寧資源鄉鎮<span>{{selectedCountry.noresource}}個</span></div>
          <div class="detail noborder">沙漠比率<span class="number">{{selectedCountry.dessert}}%</span></div>
        </div>
      </div>
      <div id="map-board" :class="{show: boardShow}">
        <div id="board-title">{{selectedCountry.location}}</div>
        <div class="board-text">老年人口<span>{{selectedCountry.old}}</span></div>
        <div class="board-text">105年度癌症死亡人口<span>{{selectedCountry.cancer}}</span></div>
        <div class="board-text">多少零安寧資源鄉鎮<span>{{selectedCountry.noresource}}</span></div>
        <div class="board-text" id="board-text-s">沙漠比率<span id="dessertNumber" class="number">{{selectedCountry.dessert}}%</span></div>
      </div>
      <div id="map-board-s">
        <div id="board-title-s">花蓮縣</div>
        <div class="board-text">人口數<span>330911</span>人</div>
        <div class="board-text">老年人口數<span>48649</span>人</div>
        <div class="board-text">每萬人口病床數<span class="number">132</span>床</div>
        <div class="board-text">每萬人口執業醫事人員數<span class="number">130</span>人</div>
      </div>
      <div id="map-board-ss">
        <div id="board-title-ss">臺北市</div>
        <div class="board-text">老年人口<span>419130</span></div>
        <div class="board-text">105年度癌症死亡人口<span>5219</span></div>
        <div class="board-text">多少零安寧資源鄉鎮<span>0</span></div>
        <div class="board-text" id="board-text-ss">沙漠比率<span id="dessertNumber2" class="number">0%</span></div>
      </div>
      <div id="map-select" :class="{open: mapmenu, show: mapSelect}" @click="expand">
        <img src="./assets/search.png">
        <span>{{selectedText}}</span>
      </div>
      <div id="svg-contain" :class="{zoomIn: mapScale, zoomInBig: mapScaleBig}">
        <div id="map" :style="{transform: 'translate(' + mapTranslate.x + ', ' + mapTranslate.y + ')'}">
          <svg id="leave" width="79" height="71" :class="{show: ext}">
          <g id="圖層_1">
            <g>
              <path class="town pharmacy leak" d="M61.2,19.7L61.2,19.7c0-0.1,0-0.2-0.1-0.3l-0.1,0L61,19.3c0,0,0,0-0.1-0.1c0,0,0-0.1,0-0.1c0,0,0-0.1,0-0.2
                l0-0.1c-0.1-0.1-0.2,0-0.2,0.1c0,0.1-0.1,0.2-0.2,0.3c0,0-0.1,0-0.1,0l0-0.2l0.1-0.4l0.2-0.1c0,0,0,0,0.1-0.1l0.1-0.1l0.1-0.1
                c0.1-0.1,0.2-0.2,0.4-0.4l0.3-0.8l0,0c0.1-0.1,0.2-0.1,0.3-0.2l0.1-0.1l0-0.1l0-0.1c0,0,0,0,0,0l0-0.1c0,0,0-0.1,0-0.1l0-0.1
                c0,0,0-0.1,0-0.1l0-0.1l0-0.1l0-0.1c0-0.1,0-0.1-0.1-0.2l-0.1,0l-0.1-0.1c0,0-0.1-0.1-0.1-0.2l0-0.1c0,0,0-0.1,0-0.1
                c0,0,0-0.1,0-0.1l0,0l0.1-0.2c0.1-0.1,0.3-0.1,0.4-0.2c0-0.1,0.1-0.1,0.1-0.2l0-0.1c0,0,0-0.1,0-0.1c0,0,0.1,0,0.1-0.1l0-0.1
                c0,0,0-0.1,0-0.1l0-0.1l0.1-0.2l0.1-0.1c0,0,0.1,0,0.1,0l0.1,0.1l0,0.1l0,0.1c0,0,0,0,0,0.1c0,0.1,0,0.1,0.1,0.2c0,0,0,0,0.1,0
                c0.1,0,0.2-0.1,0.2-0.3l0-0.1c0.1-0.1,0.2-0.2,0.4-0.2l0.1,0l0.9,0.3l0.2-0.2l0-0.1l0-0.1c0-0.1-0.1-0.2-0.2-0.3l0-0.1
                c0-0.1,0-0.1,0-0.2c0,0,0-0.1,0-0.1l0-0.1c0,0,0-0.1,0-0.1c0,0,0-0.1,0-0.1l0-0.1l0-0.1l0-0.1c0,0,0-0.1,0-0.1
                c0-0.1-0.1-0.1,0-0.2c0,0,0-0.1,0-0.1c0,0,0,0,0.1-0.1c0-0.2,0.3-0.1,0.4-0.3l0.2-0.2l0.1-0.5l0-0.1c0.1-0.1,0.2-0.2,0.3-0.2
                c0-0.1,0.1-0.1,0.1-0.2c0,0,0.1,0,0.3-0.1l0.1,0l0.4,0.1c0.1,0.2,0.1,0.2,0.2,0.3l0,0l0.3,0.1c0.1,0,0.3-0.3,0.4-0.1l0.1,0.1
                l-0.2,0.5l-0.1,0.4c-0.2,0.1-0.2,0.2-0.4,0.3l-0.1,0.2l-0.1,0.4l0.1,0.2l0,0l0.1,0c0.1,0,0.2-0.1,0.3,0.1c0.1,0,0.2-0.1,0.4-0.1
                c0.2,0.1,0.2,0.3,0.4,0.4l0,0.1l-0.1,0.4l0.5,0.2c0.1,0.1,0.1,0.3,0.3,0.3l0.1,0l0.1-0.4l0-0.1c0.1-0.1,0.2-0.1,0.3-0.1
                c0.1,0,0.2-0.1,0.3,0c0.1,0,0.1,0.1,0.1,0.2c0.1,0,0.1,0,0.1,0c0.1,0,0.1,0,0.2,0c0-0.1,0.1-0.3,0.2-0.3c0-0.1,0.1-0.1,0.2-0.1
                l0.1,0c0,0,0.1,0.1,0.1,0.2l-0.1,0.3l0,0.1c0,0.2,0.4,0.4,0.1,0.5l-0.2,0.2l0,0.1l0.1,0c0.3-0.1,0.5-0.2,0.9-0.2l0,0l0.1,0
                c0,0,0.1,0,0.1,0.1l0,0l-0.1,0.4l0.7,0.2l0,0.2c-0.1,0.1-0.2,0.2-0.2,0.3c0.1,0,0.1,0.1,0.1,0.2l0,0.1c0,0.1-0.1,0.2-0.3,0.2
                l-0.1,0c0,0,0,0-0.1,0l-0.2,0.1l-0.7-0.2l-0.1-0.2l0-0.1l0-0.1l0-0.2l0.1-0.4l-0.1,0L69.8,15c-0.2,0-0.2,0.3-0.4,0.4l-0.1,0.2
                l-0.1,0.2L69.3,16c-0.1,0-0.2,0-0.3,0c-0.1,0-0.1-0.1-0.2-0.2c0,0,0-0.1,0-0.1l-0.1,0c0,0,0,0-0.1,0l0-0.1c0-0.1,0-0.1,0-0.1
                c0-0.1,0-0.3-0.1-0.4l-0.1,0l-0.7-0.2l-0.2-0.1c-0.1,0-0.2,0.1-0.3,0.1L67,14.9l-0.2,0.5l0,0.1l0.1,0.2l-0.1,0.4l0,0.1
                c-0.1,0.1-0.2,0.1-0.3,0.3l0,0l-0.1,0.4l0,0.1c-0.2,0.2-0.3,0.3-0.4,0.4c-0.1,0.1-0.1,0.2-0.2,0.3c-0.2,0.1-0.2,0.3-0.3,0.4
                c-0.1,0.1-0.1,0.2-0.3,0.3l0,0L64.8,19l-0.2,0.1c0,0-0.1-0.1,0-0.2l0-0.1c0,0,0-0.1,0-0.1l0,0c0-0.2,0-0.3-0.1-0.4
                c0-0.1,0-0.2,0-0.3l-0.1,0l-0.2,0L64,18.5L64,18.6c-0.1,0-0.1,0.1-0.2,0.1l-0.1,0c-0.1,0,0-0.1-0.1-0.1c-0.1,0.1-0.2,0.2-0.3,0.3
                l-0.1,0.3c-0.1,0-0.1,0.2-0.3,0.1c0,0-0.1,0-0.1,0c0,0-0.1-0.1-0.1-0.2c0.1-0.2,0.2-0.3,0.3-0.4l0-0.1l0-0.1c0,0,0-0.1-0.1-0.2
                l-0.2,0l-0.2,0l-0.1-0.1c-0.1-0.1-0.1-0.3-0.2-0.4c-0.1-0.1-0.2,0.1-0.2,0.2c0,0,0,0,0,0.1l0,0.1c0,0.1-0.1,0.1-0.1,0.1l-0.1,0
                l-0.1,0l0,0l-0.1,0.1l-0.1,0.4l0.1,0.3c0,0,0,0.1,0,0.1l-0.1,0.1c0,0,0,0.1,0,0.1c0,0,0,0.1,0,0.1c0,0,0,0.1,0,0.1
                c0,0,0,0.1,0,0.1l0,0.1c-0.1,0-0.1,0.2-0.2,0.1L61.2,19.7"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M58.4,14.8L58.4,14.8L58.4,14.8c-0.1-0.1-0.1-0.1-0.1-0.2c0,0,0,0,0-0.2l0.2-0.6l-0.1-0.1c0,0,0,0,0-0.1
                l0-0.2l0,0l0-0.1l0-0.1l0-0.1c0,0,0-0.1,0-0.1c0,0,0-0.1,0-0.1c0,0,0-0.1,0-0.1c0-0.1-0.1-0.2-0.2-0.3L58,12.3l0.3-0.8l0,0
                c-0.1-0.1-0.1-0.1-0.1-0.2c0,0,0-0.1,0-0.1l0-0.1c0,0,0-0.1,0-0.1l0-0.1c0,0,0-0.1,0-0.1l0-0.1l0-0.1l0-0.1c0-0.1,0-0.1,0-0.1l0,0
                c0,0-0.1-0.1-0.2-0.1l-0.1,0.2l-0.4,1.2L57,11.4l-0.1,0L56.4,13l0,0c-0.2,0.1-0.4,0.2-0.6,0.2c0,0-0.1,0-0.1,0.1l0,0.1l0,0.1l0,0
                c0,0,0,0.1-0.1,0.1l-0.1-0.2l0.1-0.2l0-0.1c0,0,0-0.1,0-0.1l0.3-0.8l-0.1-0.1c0-0.1,0-0.1,0-0.2l0,0l-0.1-0.1c0,0,0,0-0.1-0.1
                c0,0-0.1,0-0.1-0.1c0,0,0,0-0.1,0l-0.1,0l-0.1-0.1c0,0,0-0.1,0-0.1c0-0.1,0.1-0.1,0.1-0.1l0.2-0.2c0.1-0.1,0.2-0.1,0.2-0.1l0.2,0
                c0,0,0.1,0,0.2-0.1l0.1,0c0,0,0.1,0,0.1-0.1l0-0.1c0,0,0-0.1,0.1-0.1l0.3,0.1l0.1,0.1l0.1,0l0.2-0.1c0,0,0.1-0.1,0.2-0.2l0.2-0.7
                l0-0.2l0-0.1c0,0,0-0.1,0-0.1c0,0,0,0,0-0.1l0-0.1l0,0l0,0c0-0.1,0.1-0.1,0.2-0.1c0.1-0.1,0.2,0,0.3-0.1c0.1,0,0.1,0,0.2,0l0.1,0
                l0,0l0,0l0,0.1c0,0,0,0,0,0.1l0,0.1l0,0.1c0,0,0,0.1,0,0.1c0,0,0,0,0,0.1l0,0.1c0.2-0.1,0.3-0.3,0.4-0.5c0,0,0.1-0.1,0.2-0.1
                l0.1,0l0.1,0c0,0,0,0.1,0.1,0.1c0,0,0,0.1,0,0.1c0,0,0,0.1,0,0.1c0,0,0,0.1,0,0.1c0,0,0,0.1,0,0.1c0,0,0,0.1,0,0.1l0,0.1
                c0,0.1,0.1,0.2,0.1,0.2l0.2,0c0,0,0.1,0,0.2,0c0,0,0.1,0,0.1,0c0.1,0,0.1,0,0.1,0.1c0,0,0.1,0.1,0.1,0.1l0,0.1l0,0.1
                c-0.1,0.1-0.2,0.2-0.2,0.3l0,0.1l0,0.1l0,0.1c0,0,0,0.1,0,0.1l0.1,0.2c0,0,0.1,0,0.1,0.1c0,0,0.1,0,0.1,0.1c0,0,0,0,0,0l0,0l0,0.1
                c0,0,0,0.1,0,0.1l0,0c0,0.1-0.1,0.2-0.2,0.2c0,0,0,0-0.1,0l0,0l-0.1-0.1l0,0l-0.2,0l-0.3,0.8l0.1,0.1l0,0.1l0,0.2l0,0.1l0,0
                l-0.4,0.3l-0.3,0.8l0.1,0.2l0,0.1l0,0.1c0,0.1-0.1,0.1-0.1,0.2l0,0.1L58.9,15l0,0.1c-0.1,0-0.1,0-0.3,0
                C58.4,15.2,58.5,14.9,58.4,14.8"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M61.7,16.1c0,0-0.1-0.1-0.1-0.1l-0.1,0l-0.1,0l0-0.1c0-0.1,0.1-0.1,0.1-0.1c0.1,0,0.1,0,0.1,0
                c0,0,0.1,0,0.2,0l0.1,0c0,0,0.1,0,0.1,0.1c0,0,0,0,0.1,0.1l0,0l0.1,0c0,0,0.1,0,0.1,0c0,0,0.1,0.1,0,0.1c-0.1,0-0.1,0.1-0.2,0
                C62,16.1,61.9,16.1,61.7,16.1C61.8,16.1,61.7,16.2,61.7,16.1"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M62.3,16.3c0-0.1,0.1-0.1,0.2-0.1l0.1,0c0,0,0,0.1,0,0.1C62.4,16.4,62.4,16.3,62.3,16.3L62.3,16.3"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M63.1,15.8c0.1-0.1,0.2-0.1,0.3-0.1l0,0.1c0,0-0.1,0.1-0.1,0.1L63.1,15.8C63.2,15.9,63.1,15.8,63.1,15.8"/>
            </g>
          </g>
          <g id="連江_x5F_外框">
            <polygon class="st1" points="6.5,6.5 6.5,63.7 32.3,63.7 32.3,35.1 74.2,35.1 74.2,6.5 	"/>
          </g>
          <g id="連江_x5F_東引鄉">
          </g>
          <g id="連江_x5F_北竿鄉">
            <g>
              <path class="town pharmacy leak" d="M42.4,26.2c-0.2,0-0.3-0.3-0.4-0.1l-0.1,0.1c0,0,0,0-0.1,0l-0.2,0l-0.4,0.1l-0.1,0.1l-0.1,0l-0.1,0
                c0,0-0.1,0-0.1,0c0,0-0.1-0.1-0.1-0.1c0-0.1,0-0.1,0-0.2l0-0.1c0-0.1,0-0.1,0-0.2c0,0,0-0.1,0-0.1l0-0.1l0-0.1l0-0.1l0-0.1
                c0,0,0,0-0.1-0.1c0,0,0,0,0-0.1c0,0,0-0.1,0-0.1l0-0.1c0,0,0.1-0.1,0-0.1l0-0.1l-0.1-0.1c0,0,0,0,0.1-0.1l-0.1-0.4l0.1-0.1
                c0,0,0,0,0.1-0.1l0,0l0.1-0.1l0,0L41,24c0,0,0-0.1,0.1-0.1c0,0,0,0,0.1-0.1l0,0c0,0,0-0.1,0.1-0.1c0-0.1,0.1-0.3,0.1-0.4
                c0,0,0-0.1,0-0.1c0,0,0-0.1-0.1-0.1c0,0-0.1-0.1-0.1-0.1l0,0l0-0.1c-0.1,0,0-0.1,0-0.1c0,0,0,0,0-0.1c0-0.1,0-0.2,0.2-0.3
                c0.1-0.1,0.1-0.2,0.3-0.3c0.1-0.1,0.1-0.3,0.2-0.4l0-0.1l0-0.1c0,0-0.1-0.1-0.1-0.1c0,0,0,0,0-0.1c0,0,0-0.1-0.1-0.1
                c0,0,0,0-0.1-0.1c-0.1,0-0.1-0.1-0.1-0.1c0,0,0-0.1-0.1-0.1l-0.1-0.2c0-0.1,0-0.2,0-0.3l0-0.1l0-0.1l0-0.1c0,0,0,0,0-0.1
                c0,0,0,0,0-0.1L41,20.1l-0.2-0.5l0,0c-0.1-0.2,0-0.3,0.1-0.3l0.1,0c0,0,0,0,0.1,0l0.1,0l0.1,0c0,0,0.1,0,0.1,0c0,0,0.1,0,0.2,0
                l0.1,0l0.1,0.1l0.4-0.1c0-0.1,0.1-0.2,0.2-0.4l0,0l0.3-0.1l0.1-0.2c0-0.1,0-0.1,0-0.1c0,0,0.1,0,0.1,0l0.1,0c0,0,0,0,0.1,0
                c0.1,0,0.2-0.1,0.2-0.2l0,0c0.1,0,0.1-0.1,0.1-0.2l0,0l0.2-0.1l0.3,0c0,0,0.1,0,0.2,0l0.1,0l0.6-0.2c0.2-0.2,0.4-0.4,0.6-0.8
                c0.1-0.1,0.2-0.3,0.3-0.4l0.1-0.2l0.5-0.2c0.2-0.2,0.2-0.4,0.4-0.5c0.1,0,0.1-0.1,0.1-0.2c0-0.2,0.1-0.4,0.2-0.6l0.1,0
                c0.1,0,0.2-0.2,0.3-0.2l0.2-0.1l0.3-0.1l0.3,0l0.1,0l0,0c0.1,0,0.2,0,0.2,0.1c0,0,0,0.1,0,0.2l0.1,0.1c0,0,0.1,0,0.1,0.1
                c0,0,0,0.1,0.1,0l0,0.1l0,0.1l0,0.1c0,0,0,0.1,0,0.1l0.1,0c0.1,0,0.1,0.1,0.2,0.1l0.1,0l0.4-0.1c0.1,0,0.2,0.1,0.3,0.2l0,0.1
                c0,0.1,0,0.1,0,0.2c0,0.1,0,0.1-0.1,0.1l-0.1,0.2c0,0.1,0,0.2-0.1,0.2c-0.1,0-0.1,0.1,0,0.2l0.1,0.1c0,0-0.1,0-0.1,0.1l0.2,0.1
                l0.1,0c0,0,0.1,0,0.1,0l0,0l0.1,0l0.1,0.1c0,0,0.1,0.1,0,0.1c0,0.1-0.1,0.2-0.2,0.3l-0.1,0c0,0,0,0-0.1,0l-0.1,0c0,0,0,0-0.1,0
                l0,0l-0.1,0l-0.1,0c0,0-0.1,0-0.1,0c0,0.1-0.1,0.3-0.1,0.4l0,0.1c0,0,0,0,0,0.1c0,0,0,0,0.1,0.1l0,0l0.1,0c0,0,0.1,0,0.1,0
                c0.1,0,0.2,0.2,0.3,0.1c0.1-0.1,0.1-0.3,0.2-0.5l0.1,0l0.3-0.1c0-0.1,0.1-0.1,0.1-0.2c0-0.1,0.1-0.1,0.2-0.2c0,0,0,0,0.1,0
                c0,0,0.1,0,0.1,0l0.1,0c0,0,0.1,0,0.1,0c0,0,0.1,0,0.1,0c0,0,0.1,0,0.1,0l0.1,0.1l0.4-0.2l0.1,0.1l0,0l0,0c0,0,0.1,0.1,0.1,0.2
                c-0.2,0.1-0.1,0.4-0.4,0.6c0,0.1-0.1,0.2-0.1,0.2l0,0.1c0,0,0.1,0.1,0.2,0.2c0,0,0,0.1-0.1,0.2l-0.3,0.1l-0.1,0L51.2,19
                c-0.2,0.1-0.3,0.2-0.4,0.3c0,0.1,0,0.1,0,0.2c0,0,0,0.1,0.1,0c0,0,0.1,0,0.2,0.1l0.1,0.2c0,0.1,0,0.2,0.1,0.3l-0.1,0.1l0,0.1
                c0,0,0.1,0.1,0.1,0.1c0,0.1-0.1,0.1,0,0.2l0.1,0c0,0,0.1,0,0.1,0c0,0,0,0.1,0,0.1c-0.1,0.1-0.2-0.1-0.3,0c0,0.1,0,0.1-0.1,0.1
                c0,0-0.1,0-0.1,0c-0.1,0-0.1,0-0.1-0.1c0-0.1,0.1-0.1,0-0.2c0-0.1-0.1,0-0.1-0.1l0.1-0.2c0,0,0,0-0.1-0.1l0-0.3
                c0-0.1-0.1-0.1-0.2-0.2c-0.1,0-0.2,0-0.3-0.1c0,0,0,0,0-0.1c0,0-0.1-0.1-0.2-0.1L49.9,19l0,0c-0.2-0.2-0.4-0.3-0.7-0.4l-0.1-0.1
                l-0.9,0.3L48.1,19c0,0,0,0.1,0,0.1l0,0.1l0,0.1c-0.1,0.1,0,0.3-0.1,0.5l0,0l-0.2,0.1l-0.1,0L47.4,20l-0.1,0c-0.1-0.1-0.2,0-0.3,0
                l-0.1,0.1c-0.1,0.1-0.2,0.2-0.2,0.3l0,0c-0.3,0-0.2,0.4-0.4,0.5c-0.1,0-0.2,0-0.2-0.1c-0.1-0.1,0.1-0.2,0.1-0.3L46,20.2l0,0
                c-0.1-0.1-0.2-0.1-0.3-0.2l-0.1,0c-0.1,0-0.1,0-0.3-0.1l0,0l-0.6,0.2l-0.2,0.1l-0.2,0.1l-0.1,0.1l-0.4,0.1l-0.2,0.1l-0.1,0l0,0
                c-0.1,0-0.1,0.1-0.1,0.1c-0.1,0.1-0.2,0.2-0.3,0.3L43,21.1c-0.2,0.1-0.4,0.3-0.5,0.5c-0.1,0.1-0.1,0.2-0.3,0.2c0,0-0.1,0-0.2,0.2
                l0,0.1l0.1,0.3l0,0.1c0,0.2-0.2,0.3,0,0.5l0,0.1l0.2,0.5l-0.1,0.1c0,0,0,0,0,0.1l-0.1,0.3l0,0.1l0,0c0,0.2-0.1,0.2-0.1,0.4
                c0,0.1,0,0.1,0,0.2c0,0.1,0,0.1,0,0.2l0,0.1l0,0.1l0.1,0.1l0.1,0.1l0.2,0.5L42.5,26C42.5,26.1,42.5,26.2,42.4,26.2"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M51.2,15.3c-0.1,0-0.1-0.1-0.2-0.2c0,0,0-0.1-0.1-0.1c-0.1,0-0.1,0-0.1-0.1c0-0.1,0.1-0.2,0.1-0.4
                c0-0.1,0-0.2,0-0.3c0,0,0.1-0.1,0-0.2l0,0l0,0c0,0,0-0.1,0-0.1l0,0l0.1,0l0,0l0.1,0c0,0,0.1-0.1,0.1-0.1l0.1,0l0.1,0l0,0l0,0.1
                c0,0,0.1,0,0.1,0.1c0,0,0,0.1,0,0.1c-0.1,0-0.1,0.1-0.2,0.1c0,0,0,0-0.1,0l-0.1,0c-0.2,0-0.1,0.2-0.1,0.4l0,0.1l0,0.1l0,0.1
                C51.3,15.2,51.3,15.3,51.2,15.3"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M52,14.4l-0.2,0.1l-0.1,0c0,0,0-0.1,0-0.1l0.1-0.2l0.1,0c0,0,0.1,0,0.1,0l0.1,0c0,0,0,0,0.1,0
                c0.1,0,0.1,0,0.1,0c0,0.1,0,0.1-0.1,0.2L52,14.4L52,14.4"/>
            </g>
          </g>
          <g id="連江_x5F_南竿鄉">
            <path class="town pharmacy leak" d="M20.9,24c0.1-0.1,0.3,0,0.5,0.1c0.2,0.1,0.3,0.2,0.5,0.2c0.1,0,0.2,0,0.3,0.1c0.1,0.1,0,0.1,0,0.2
              c0,0.1-0.1,0.1,0,0.2c0.1,0.1,0.2,0.1,0.3,0c0.4,0.3,0.5,0.3,1,0.2c0.2-0.1,0.9-0.3,1-0.2c0.1,0.1-0.1,0.3,0,0.5
              c0,0.1,0.3,0.3,0.2,0.5c-0.1,0.3-0.5-0.2-0.8-0.2c0,0.1-0.1,0.2-0.1,0.3c0,0.1-0.1,0.2-0.1,0.3c0,0,0.1,0.1,0.1,0.1
              c0,0.2-0.1,0.2-0.2,0.4c-0.1,0.1-0.1,0.4-0.1,0.5c0,0.2-0.2,0.5-0.2,0.6c0,0.3,0.2,0.3,0.1,0.5c-0.1,0.1-0.1,0.2-0.2,0.2
              c0,0-0.3,0-0.3,0.1c0,0.3,0.6,0,0.7-0.1c0.2-0.1,0.4-0.1,0.6,0c0.2,0,0.4,0.1,0.6,0c0.2-0.1,0.2-0.5,0.5-0.4
              c0.2,0.1,0.2,0.4,0.2,0.6c-0.1,0-0.1,0.1-0.2,0.1c0,0.6,0.4,0.3,0.9,0.3c0.1,0.2,0,0.4,0,0.6c0,0.3,0.1,0.3,0.3,0.4
              c0.4,0.2,0.3,0.7,0.8,0.6c0-0.3,0-0.4,0.2-0.6c0.2-0.2,0.3-0.3,0.5-0.4c0.2-0.1,0.5-0.1,0.7-0.1c0.2,0,0.3,0.2,0.5,0
              c0.4-0.3,0.1-0.9,0-1.3c-0.1-0.2,0-0.3,0.1-0.5c0.1-0.2,0.3-0.4,0.5-0.5c0.1,0,0.3,0.1,0.4,0.1c0.2,0,0.1-0.2,0.3-0.2
              c0.2-0.1,0.8-0.1,0.9,0.1c0.1,0.1,0,0.7,0.4,0.6c0.2-0.1,0.2-0.5,0.2-0.7c0.2-0.3,1.2-0.3,1.6-0.2c0.3,0,0.6,0,0.8,0
              c0.2,0,0.5-0.1,0.7,0C35,27,35,27.2,34.9,27.3c-0.1,0.1-0.3,0.2-0.3,0.3c-0.1,0.2,0.3,0.8-0.3,0.7c0,0.3,0.3,0.6,0,0.9
              c-0.1,0.1-0.2,0.2-0.3,0.3c-0.1,0.1-0.2,0.3-0.3,0c-0.2,0.2-0.3,1.2-0.6,1.1c-0.2,0.3-0.5,1.6-1,1.2c-0.1-0.1-0.4-0.4-0.5-0.6
              c-0.1-0.2,0-0.5-0.1-0.8c-0.2,0-0.4,0.3-0.6,0.4c-0.1,0.1-0.3,0.2-0.3,0.3c-0.1,0.1,0,0.3,0,0.5c0,0.2-0.2,0.3-0.2,0.4
              c0,0.1,0,0.3,0,0.3c-0.1,0.2-0.4,0.2-0.6,0.4c0.2,0.3-0.1,0.5-0.3,0.7c-0.3,0.3-0.4,0.6-0.8,0.6c-0.4,0.1-0.9,0.4-1.2,0.1
              c-0.2-0.2-0.1-0.5-0.2-0.8c-0.2-0.1-0.4,0.3-0.6,0.3c-0.2,0.1-0.2-0.1-0.3,0.1c-0.1,0.1,0,0.3-0.1,0.4c-0.2-0.1-0.3-0.4-0.5-0.4
              c-0.1,0-0.3,0.5-0.4,0.6c-0.3,0.4-0.3,0.7,0.3,0.4c0.1,0.1-0.2,0.6-0.4,0.6c-0.3,0.2-0.3-0.1-0.6-0.3c-0.1,0.1-0.2,0.2-0.3,0.4
              c-0.1,0.2-0.2,0.2-0.3,0.3c-0.3,0.2-0.5,0.4-0.8,0.1c0.1-0.2,0.2-0.2,0.3-0.4c0-0.1,0.1-0.4,0-0.6c-0.1-0.5-0.5-0.3-0.8-0.1
              c-0.3,0.1-0.6,0-0.9,0.1c-0.1,0-0.2,0.2-0.3,0.2c-0.2,0-0.1,0-0.3-0.2c-0.1-0.1-0.1-0.1-0.1-0.2c-0.2-0.1-0.6,0.1-0.8,0
              c0-0.1,0.1-0.2,0-0.4c0-0.1-0.1-0.2-0.1-0.3c0-0.2,0.1-0.5-0.2-0.6c-0.2,0.1-0.2,0.3-0.3,0.4c-0.3,0.3-0.2,0-0.4-0.1
              c-0.2-0.1-0.5,0-0.3-0.3c0-0.1,0.2-0.1,0.3-0.2c0.1-0.1,0.1-0.2,0.1-0.2c0.4-0.7,0.7-1.5,1.2-2.2c-0.1,0-0.1-0.1-0.2-0.1
              c0.1-0.5,1.2-1,0.8-1.6c-0.4-0.7-0.9,0.1-1.4,0.1c0,0,0-0.1,0-0.1c0.1-0.2,0.3-0.4,0.4-0.5c0.1-0.1,0.2-0.2,0.3-0.4
              c0-0.1,0.1-0.4,0.2-0.4c0.2-0.1,0.5,0.5,0.7,0c0-0.1,0-0.3,0-0.4c0-0.2,0.1-0.3,0.2-0.4c0-0.1,0.2-0.5,0.2-0.5
              c0-0.2-0.1-0.1-0.2-0.2c-0.2-0.1-0.4-0.1-0.6-0.3c-0.1-0.1-0.4-0.4-0.4-0.5c0-0.3,0.3-0.3,0.2-0.7c-0.1-0.3-0.2-0.4-0.1-0.6
              C20.8,24.4,21.2,24,20.9,24"/>
          </g>
          <g id="連江_x5F_莒光鄉">
            <g>
              <path class="town pharmacy leak" d="M14.3,50.8l0-0.4l-0.1-0.2c0-0.1-0.1-0.1-0.1-0.1l-0.1,0c0,0,0,0-0.1,0c0,0-0.1,0-0.1,0c0,0,0,0-0.1-0.1
                c0,0-0.1-0.1-0.1-0.1l0,0l-0.1,0c0,0-0.1,0-0.1,0l-0.1,0l-0.1,0l-0.1,0c0,0-0.1,0-0.1,0l-0.1-0.1c0,0,0,0,0,0l0-0.1c0,0,0,0,0,0
                l0,0l0,0l0,0l0-0.1c0,0,0,0,0,0l-0.1-0.1l-0.1,0c0,0-0.1,0-0.1-0.1l0-0.1c0-0.1-0.1-0.3-0.2-0.4l0,0c-0.1-0.1-0.1-0.2-0.2-0.3
                c0,0,0-0.1,0-0.1c0-0.1,0-0.1,0-0.1c0,0,0-0.1,0-0.1c0,0-0.1,0-0.1,0c-0.1,0-0.1-0.1-0.1-0.2l0,0c0,0,0-0.1,0-0.1
                c0,0,0.1-0.1,0.1-0.2c0.1-0.1,0.3-0.2,0.4-0.2l0.1,0l0.2,0c0.1-0.1,0.2-0.2,0.3-0.2l0.2,0l0.1-0.1l0.4,0l0.1,0.1l0,0l0.1,0.1
                l0.1,0.1c0.1,0.1,0.2,0,0.3,0l0.2-0.1l0.1-0.1l0,0l0.1,0l0,0l0.1,0l0.1,0c0,0,0.1,0,0.1-0.1c0,0,0.1,0,0.2,0
                c0.1,0.1,0.2,0.1,0.3,0.1c0.2-0.1,0.2-0.2,0.5-0.2c0,0,0,0,0.1,0c0.1-0.1,0.2-0.1,0.3-0.2l0.1,0c0,0,0.1,0,0.1,0l0.1,0.1
                c0,0,0,0,0.1,0l0,0l0.1,0l0.1,0.1l0.4,0l0.1,0.1l0.1,0c0,0,0.1,0,0.1,0c0,0,0.1,0,0.1,0l0,0l0,0c0,0,0,0,0,0.1l-0.1,0.1l0,0.3l0,0
                c0,0.1-0.1,0.1-0.1,0.2c0,0.1,0.1,0.1,0.1,0.1c0,0.2-0.2,0.1-0.2,0.2c0,0,0,0,0,0.1c0,0.1,0,0.1-0.1,0.2l-0.1,0c0,0,0,0-0.1,0
                c0,0,0,0-0.1,0c-0.1,0-0.1,0.1-0.2,0.2c-0.1,0.2-0.3,0.5-0.6,0.5l-0.1,0l-0.3,0l-0.1,0c-0.2,0-0.4,0-0.4,0.2l0,0.1l0,0.2l0,0.1
                c0,0,0.1,0.1,0.1,0.2l0,0c0,0.2-0.2,0.1-0.3,0.2c0,0-0.1,0-0.2,0l0,0.1c0,0,0,0.1,0,0.1l0,0c0,0.1-0.1,0.2-0.2,0.3l0,0l0,0l-0.1,0
                C14.4,50.8,14.4,50.8,14.3,50.8L14.3,50.8"/>
            </g>
            <g>
              <path class="town pharmacy leak" d="M20.9,56.4C20.8,56.4,20.8,56.4,20.9,56.4l0-0.1c0,0,0,0,0.1,0l0.1-0.1c0.1,0,0.2,0,0.3-0.2l0-0.4l0,0
                c0-0.2,0.2-0.2,0.2-0.4l0,0c0-0.1,0.1-0.1,0.1-0.2l-0.1-0.9l0-0.1c0,0,0-0.1,0,0l0-0.2c0.2,0,0.3,0.1,0.5,0.2l0.1-0.1
                c0.2-0.1,0.3-0.2,0.4-0.4c0.1-0.2,0.3-0.2,0.2-0.4c0,0,0,0,0-0.1l0.1-0.2l0-0.1c0,0,0-0.1,0-0.1c0.1,0,0.1-0.1,0.1-0.2
                c0,0,0-0.1,0-0.1l0-0.1l0,0l0-0.1l0,0c0-0.1,0-0.1,0.1-0.2l0-0.1l0-0.1c0-0.1,0.1-0.1,0.1-0.2l0-0.1c0,0,0-0.1,0-0.2
                c0,0,0-0.1,0-0.1c0,0,0-0.1,0.1-0.1l0,0l0.1,0c0,0,0.1,0,0.1-0.1c0-0.1,0-0.1,0.1-0.2l0.1-0.1l0.1,0l0.1,0c0,0,0,0,0.2,0.1l0,0
                l1-0.1l0.1,0c0,0,0,0.1,0,0.1l0.1,0.1c0.1,0,0.3-0.1,0.4-0.1c0-0.1,0.2,0,0.2-0.1c0.1,0,0.1-0.1,0.3-0.1c0.1,0,0.2-0.1,0.2-0.1
                l0-0.1l-0.3,0l-0.1,0c0-0.1,0-0.1,0.1-0.1c0,0,0.1,0,0.2,0c0-0.1,0.1-0.2,0.2-0.3l0,0l0.1,0l0.6,0l0.2,0.1l0,0.2l0,0.1
                c0,0.1,0.1,0.1,0.2,0.1l0.1,0.1l0,0.2l0,0.1c-0.1,0.1-0.1,0.2-0.2,0.2L27.6,51c-0.1,0-0.1,0-0.1,0.1l0,0.1c0,0,0,0.1-0.1,0.1
                c-0.1,0-0.1,0.1-0.1,0.1l0.1,0l0,0c0,0,0,0.1,0,0.1c0,0.1-0.1,0.1-0.1,0.2c-0.2,0.1-0.5,0.1-0.5,0.4c0,0,0,0.1,0.1,0.1l0,0
                c0,0,0.1,0,0.1,0l0,0c0.1,0,0.1,0.1,0.1,0.1c-0.2,0.1-0.3,0.3-0.5,0.3c-0.1,0-0.1-0.1-0.2-0.1c0,0-0.1,0-0.1,0.1l0.1,0
                c0,0,0.1,0,0.1,0.1c0,0,0,0,0,0C26.4,53,26.2,53,26.1,53l-0.1,0L26,53c0,0,0,0,0,0.1c0,0.1,0.1,0.1,0.1,0.1L26,53.3l-0.5,0l0.1,1
                l0,0.1c0,0.1-0.1,0.1-0.1,0.1c-0.1,0-0.1-0.1-0.2-0.2c-0.2,0.1-0.4,0.3-0.6,0.4c-0.1,0.1,0,0.2,0,0.3c0,0-0.1,0.1-0.1,0.2l-0.1,0
                l-0.1,0l-0.1,0c-0.1,0-0.2-0.1-0.3-0.2l0,0l0-0.1l0-0.1c0,0,0,0,0-0.1c0-0.1-0.1-0.1-0.1-0.2l0-0.1l0-0.1c-0.1,0-0.3,0.2-0.3,0.3
                l0,0.1l0,0.1c-0.1,0.2-0.1,0.4-0.3,0.5L23,55.5l0,0c0,0.1-0.1,0.2-0.2,0.3l-0.2,0.2l-0.5,0L22,56.2l0,0.1c0,0.1,0,0.2-0.1,0.3
                l-0.1,0c0,0,0,0-0.1,0c-0.1,0-0.2,0.2-0.4,0.1C21.2,56.6,21,56.6,20.9,56.4"/>
            </g>
            <path class="town pharmacy leak" d="M24.2,50.2c0,0-0.1-0.1-0.1-0.2c0-0.1,0.2-0.1,0.1-0.2c0-0.1,0.1-0.1,0.2-0.1c0.1-0.1,0.2-0.3,0.2-0.4
              c0-0.1-0.1-0.2-0.2-0.3c0.1-0.1,0.3-0.2,0.2-0.3c0-0.1,0.2-0.2,0.2-0.2l0.2,0.1V49L25,49.3v0.4c0,0.2-0.2,0.2-0.3,0.2L24.2,50.2z"
              />
          </g>
          <g id="金門_x5F_外框">
            <rect x="35.1" y="37.9" class="st1" width="39.1" height="25.8"/>
          </g>
          <g id="烏坵_x5F_外框">
            <rect x="62.5" y="39.6" class="st1" width="10" height="5.6"/>
          </g>
          <g id="金門_x5F_烏坵鄉">
            <g>
              <path class="town pharmacy leak" d="M66.7,41.6l-1.3-0.7c0,0-0.3-0.4-0.4,0.4c-0.1,0.8,1.1,1.9,1.1,1.9l1,0.7c0,0,0.7-0.2,0.5-0.5
                c-0.2-0.4-0.4-0.5-0.4-1C67.1,41.8,66.7,41.6,66.7,41.6z"/>
              <path class="st0" d="M67.9,43.8c0,0,0.7,0.6,1,0c0.3-0.6,0.4-0.1,0.8,0c0.4,0.1,0.2-1.1-0.4-1.2C68.8,42.5,68,43.2,67.9,43.8z"/>
            </g>
          </g>
          <g id="金門_x5F_金湖鎮">
            <path class="town leak" d="M64.4,54l0.2,0.3l0.6,0.2l-0.4,1.4l-0.6-0.1l-0.6,0.5l0.6,0.7l-0.5,0.7l-0.4,0.1l-0.2,0.7l-0.3,0.3l-0.5,0
              l-0.5,0.5l-0.8,0.4l-1,0.1l0.7-1.1l-0.6-0.9l-1.8-0.5l0.1-0.3l-0.9-0.4l-0.8-0.1l-1,0.1L54.3,57L53,57.6l-0.2-0.4l0.3-0.8L53,55.1
              l0.8-1.1l-0.1-0.4l-0.1-1.4l0.7-0.6l0.4,1l0.7,1l0.4,0.2l0.6,0.1l0.4,0.6l1.4-0.6l0.7-0.5l0.6-0.3l0.5-0.5l0.7-0.1l0.2,0.5l1.2,1.5
              l0.9,0.9l0.5-0.2L64.4,54z"/>
          </g>
          <g id="金門_x5F_金沙鎮">
            <path class="town leak" d="M64.4,54l-1,1.1L63,55.3L62,54.4l-1.2-1.5l-0.2-0.5L60,52.5L59.5,53l-0.6,0.3l-0.7,0.5l-1.4,0.6l-0.4-0.6
              l-0.6-0.1l-0.4-0.2l-0.7-1l-0.4-1l0.8-0.7l0.2-0.7l0.5-0.3l-0.2-1.1l0-0.6l0.8-0.4l0.5-0.9l0.4-0.3l-0.2-0.8l0.7,0.1l0.6-0.4
              l0.4,0.3l0.5-0.2l0.5,0.3l0.6,0l0.4,1l0.3,0.5l1.6,0.5l-0.1,0.6l0.2,0.6l0.4,0.4l0,0.5l0.7,0.8l0.7,0.1v0.4l-0.6,0.5l0.1,1l0.2,0.8
              L64.4,54z"/>
          </g>
          <g id="金門_x5F_金寧鄉">
            <path class="town pharmacy leak" d="M53.5,52.1l0.1,1.4l0.1,0.4L53,55.1l0.1,1.3l-0.3,0.8l0.2,0.4L52.3,58l-0.6,0.5l-0.4,0.8l-1.1-0.9l-0.6,0.6
              l-0.4-0.9l0.4-0.5l0.2-0.7L49,56.5l0.6-0.6l-0.5-0.4l-0.7,0.7L48,56.1l-0.4,0.3l-0.7-0.5l-0.1-0.5l-0.7-1.1l0-0.7l-1-1.5l0-0.5
              l0.7-1.3l0.7-0.4l0.8-0.2l0.6,0l0.6,0.3l0.6,0.6l0.8,1l0.8,0.5l0.8,0.1l0.4,0.3h1.3L53.5,52.1z"/>
          </g>
          <g id="金門_x5F_金城鎮">
            <path class="town leak" d="M51.3,59.4l-0.4,0.3l-0.4,0.8l-0.4,1.2l-1.1,0.6L48.5,62l-0.8-0.2l-0.6-0.7l-0.8,0l-0.2-0.4l-0.6-0.7l-1.3-0.9
              l0.3-0.5l1.1-0.2l1.2-2l0.1-0.6l0.7,0.5l0.4-0.3l0.4,0.1l0.7-0.7l0.5,0.4L49,56.5l0.8,0.5l-0.2,0.7l-0.4,0.5l0.4,0.9l0.6-0.6
              L51.3,59.4z"/>
          </g>
          <g id="金門_x5F_列嶼島">
            <polygon class="town pharmacy leak" points="41.2,54.1 42.3,54.6 42.9,55.3 43.3,55.3 43,57.4 42.7,58 42,57.7 41.3,58.2 41.3,58.6 40.9,59 
              40.1,59 39.4,59.2 38.7,60.1 38,59.6 37.5,59 37.8,58.3 37.8,57.4 38.5,56.4 38.9,55.1 39.2,54.6 40.4,54.2 	"/>
            <polygon class="town pharmacy leak" points="44.2,54.4 43.3,54.4 43.7,54 	"/>
          </g>
          </svg>
        </div>
      </div>
    </div>
    <div class="textbox" id="r-1">
      <h2 class="hidden-xs hidden-sm">破解數字迷思 從地圖看偏鄉就醫的苦</h2>
      <br/>
      探討醫療資源分布的區域差異時，不能只看病床數、醫事人員數，這樣的計算方式是假設區域內的人口和醫療機構是平均分布，但事實上醫療機構根本分布不均。《聯合報》團隊透過數據清洗，並且結合地圖畫出全國醫學中心及區域醫院位置，圖中可清楚發現，<b>大型醫療院所多集中在北部和西部，東部較少，顯示全國醫療資源分布落差，進一步觀察，每一個縣市也有醫療資源分配不均情況</b>。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-2">
      比如被衛福部稱為醫療資源豐沛的花蓮縣，主因人口較少，平均下來每萬人病床數可高達132床、醫事人員數130人，在全國名列前茅。但透過地圖就能清楚看到官方數據陷阱，花蓮縣地廣、醫院數少，且<b>三家大型醫院都集中花蓮市，花蓮中南區偏鄉民眾就醫極度不便</b>。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-3">
      以花蓮熱門景點六十石山為例，其位在花蓮縣最南邊的富里鄉，因為偏鄉醫療資源不足，當地民眾若要看慢性病、做檢查，只能跑大醫院。我們利用Google map路線規劃功能試算，當地到縣內三家大型醫院的行車時間，最短車程得花上2小時17分，才能抵達花蓮市區的門諾醫院。<br/><br/>偏鄉多老人家，普遍沒有交通工具，搭計程車到大醫院來回車資至少上千元；若搭公車，等車、換車得花上一整天。對偏鄉老人來說，就醫可謂是一條漫漫長路。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-4">
      後山醫療不均問題，花東縣市居民點滴在心頭。台東金城武樹是許多遊客造訪的熱門景點，位於好山好水的池上鄉，但這裡的長輩生活可能不像風景如此美好，翻山越嶺看病是他們的日常。<br/><br/>台東縣只有一家區域醫院馬偕台東分院，位於台東市，池上鄉居民若要就醫，最短車程得花上1小時11分。台東縣衛生局指出，台東每萬人平均病床數雖只略低於全國平均值，但若分別看台東縣內四個次醫療區（數個鄰近鄉鎮為一次醫療區），台東區只有42床，關山、成功區都不到10床，大武區更慘，掛鴨蛋。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-5">
      根據衛福部數據，屏東縣的醫療資源與全國平均相近。但把數據放到地圖上便一目瞭然，屏東縣醫療資源多集中在屏東市，南北狹長的地理位置，南端的恆春半島包含恆春鎮、車城、滿州、牡丹鄉，居民就醫極度不便。<br/><br/>以恆春鎮的墾丁大街為例，這裡的居民要到大醫院看病，最短得花上1小時26分鐘車程。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-6">
      反觀台北市，醫療資源豐沛，市區內有20家大型醫院，就醫可近性高。若以一位大安區居民為例，最短只需要6分鐘，便可抵達鄰近的台大醫院，與偏鄉居民就醫時間形成極大落差。
    </div>
    <div class="space"></div>
    <div class="space" id="r-7"></div>
    <div class="textbox" id="r-8">
      <h2 class="hidden-xs hidden-sm">52鄉鎮沒健保藥局 37萬人受影響</h2>
      <br/>
      食藥署2017年9月曾公布，「全國健保特約藥局數量已達到6000家以上，藥局密度甚至高於我們日常生活常光顧的便利商店。」但食藥署沒說的是，即使藥局密度如此高，<b>全國仍有52個鄉鎮市區連一家健保藥局都沒有，估計36.8萬人受影響</b>。
      <br/><br/>
      慢性病患者可持「慢性病連續處方箋」到附近的健保特約藥局領藥，就可免跑醫院排隊掛號、批價，但沒有健保藥局的地區多位於人口密度低的偏鄉及山區，這裡的居民必須跨區領藥，<b>他們雖然繳納相同的健保費，卻無法享受同等的醫療資源</b>。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-9">
      <h2 class="hidden-xs hidden-sm">15個超高齡鄉鎮 領藥難上加難</h2>
      <br/>
      <b>進一步分析這52個沒有健保藥局的鄉鎮市區，其中有15個是「超高齡鄉鎮」</b>。而老年人口中，高達八成至少罹患一種慢性疾病，他們必須定期領藥，是最需要健保藥局的族群。
      <br/><br/>
      包括新北市坪林、平溪、貢寮，新竹縣橫山、峨眉，苗栗縣三灣、獅潭，南投縣鹿谷、中寮，台南市南化、龍崎，高雄市田寮，花蓮縣豐濱、富里，台東縣東河都是零健保藥局。這裡的老人家怎麼辦？
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-10">
      <h2 class="hidden-xs hidden-sm">141鄉鎮缺緊急醫療資源 轉診像賭命</h2>
      <br/>
      2017年11月底，<a target="_blank" href="https://udn.com/news/plus/9734/2862448">苗栗縣公館一名張姓村長的兒子急病</a>，輾轉苗栗、新竹、台北醫院急救，5天後回天乏術，此事件凸顯苗栗緊急醫療資源不足問題。根據衛福部公布「緊急醫療資源不足」地區，轉換成鄉鎮市區於地圖上表示，<b>全國有141個鄉鎮市區缺乏緊急醫療資源，居民一旦發生突發中風、心肌梗塞、重大外傷等急重症，只能轉送其他地區，可能因此錯失黃金搶救時間</b>，有些人甚至途中就不幸死亡，轉診幾乎變成在賭命。
    </div>
    <div class="space"></div>
    <ContentContainer background-color="#FFFFFF">
      <h2>衛福部：將加強偏鄉基礎醫療照顧</h2><br/>針對醫療不均問題，衛福部次長薛瑞元表示，醫療資源不均是必然，因為醫院經營有固定成本，但他曾在屏東擔任過衛生局長，深知偏鄉醫療的問題，「偏鄉醫療強度不足，明顯跟都會相比有差距。」尤其是重急症、慢性病，以及急難災害的醫療能力都需要檢討改善。<br/><br/>他強調現下會先盤點各縣市的醫院功能，衛福部仍期待各縣市的當地醫院有一級醫院的能力，此外部分縣市因幅員遼闊，導致基礎醫療照顧能量不足，並且後送機制也有待重整改善。<br/><br/>薛瑞元表示，2018年會著重加強基礎醫療照顧，包括建立醫療人員派出模式，「老人、病人無法出門，我們醫院派人出去，這些在原鄉行之多年，非原鄉也要建立這種模式。」<br/><br/>此外，許多偏鄉人口老化，部分鄉鎮老年人口占比達20%以上，有領藥看病的需求。因此，他表示要強化前端預防工作，包括定期檢查、了解老人的服藥狀況等，避免老人家慢性病急性發作，2018年將在部分偏鄉試辦。
    </ContentContainer>
    <Section id="section-2" :src="section2" :srcWeb="section2_web" text="臨終最後一哩路 你的家鄉安寧嗎？"/>
    <div class="space" id="r-11"></div>
    <div class="textbox" id="r-12">
      <h2 class="hidden-xs hidden-sm">前5名「沙漠」縣市 6成以上鄉鎮區缺安寧資源</h2>
      <br/>
      寧靜的走完人生旅程，是許多病患的願望，但「好死」仰賴專業及資源。國內安寧療護現分為住院、共照、居家與社區三塊，《聯合報》盤點各縣市資料，發現縣市間資源落差極大：基隆市、新竹縣、台東縣、高雄市及苗栗縣等倒數5名縣市，6成6以上鄉鎮區是三種安寧資源都沒有的「沙漠」；反觀「安寧綠洲」台北市與嘉義市，各鄉鎮區都有安寧療護資源可用。病人想安心走完臨終前最後一哩路，必須遠赴外縣市找安寧病床才能圖個好死，在地善終成為奢望。
    </div>
    <div class="space"></div>
    <div class="textbox" id="r-13">
      以沙漠比率（零資源的鄉鎮區數／總鄉鎮區數）最高的基隆市為例，7個鄉鎮區內僅信義區、安樂區兩區有安寧病床、居家安寧團隊等資源，剩餘的5個鄉鎮區內什麼都沒有，沙漠比率7成1。扣除區域數量、距離等因素，台灣醫療改革基金會日前公布最新的「在地好命善終資源」排行榜中，基隆也僅有兩顆星。<br/><br/>基隆市衛生局表示，基隆幅員小，各區到醫院距離都很近，民眾要找醫院的安寧資源不會太難。但衛生局也坦言，居家安寧推動確實不易，民眾觀念、社區診所參與意願都需要提升，會持續推動。
    </div>
    <div class="space"></div>
    <div class="space" id="r-14"></div>
    <div class="space" id="r-15"></div>
    <ContentContainer background-color="#FFFFFF" id="r-16">
      <p>安寧療護資源分布的最綿密的「綠洲」縣市台北市及嘉義市，縣市內所有鄉鎮區都有至少一種安寧療護資源可利用，沙漠比率0％，民眾就近就可以找到安寧病床，或居家安寧團隊，來陪伴家人走過人生最後一哩路。</p>
      <p><br/></p>
      <p>日前，一根鼻胃管引發作家瓊瑤與平家之間的激烈衝突，怎麼做對失智的皇冠出版社創辦人平鑫濤最好，社會有不同的聲浪；前體育主播傅達仁遠赴瑞士，成為安樂死機構合格會員，再次掀起各界對「善終」的關注與討論。</p>
      <p><br/></p>
      <p>台灣安樂死尚未合法化，仍有爭議和疑慮待討論；安寧療護的推動，則已是各界共識，減少末期病人在病榻上的折磨，是安寧療護的功能與目標。儘管參與的醫療院所家數、病人利用率看似逐年增加，從數據及訪談中，發現安寧療護發展目前仍遇到<b>三大問題：</b></p>
      <p><br/></p>
      <h2>一、各縣市落差大，住哪裡決定能否「好好死」？</h2>
      <p><br/></p>
      <p>台灣醫療改革基金會2015年首度公布「在地好命善終排行榜」，凸顯出縣市間的安寧療護資源差距。兩年多過去，安寧療護資源在各縣市間還是有不小落差。醫改會研究員辜智芬直言，預算不足是共同原因。</p>
      <p><br/></p>
      <p>醫改會曾詢問過各地衛生局長，多數都提到預算不足問題。辜智芬說，衛生佔整體市政經費平均僅有1.4％到1.5％，這些經費要發展癌篩、衛教、急重難症等多元項目，能撥給安寧療護的微乎其微。</p>
      <p><br/></p>
      <p>微薄的經費更考驗縣市首長的態度。辜智芬說，安寧療護朝居家、社區方向發展已是世界潮流，「縣市首長的眼光有沒有跟上？」居家、社區安寧除了錢，更仰賴人力投入、政策支持，若縣市首長不重視，縣市本身資源再多也沒用；反觀一些小縣市，願意關注這塊，資源不多也能做出成績。</p>
      <p><br/></p>
      <p>健保署表示，安寧療護資源目標希望以次醫療區（數個鄰近鄉鎮為一個次醫療區）都有，目前還沒達到，會持續推動。</p>
      <p><br/></p>
      <h2>二、居家、社區遍地開花 恐是「海市蜃樓」</h2>
      <p><br/></p>
      <p>目前全台有一百多間診所、衛生所投入社區安寧，但第一線醫師和健保署都坦言，取得資格是一回事，真正有在做的診所還是很有限，<b>一方面是病人仍對醫院的依賴仍深，另一方面是缺乏誘因與武器、後援，讓想做的醫生卻步</b>。</p>
      <p><br/></p>
      <p>在南投縣推動社區醫療照護整合團隊多年的南投醫院放射腫瘤科主任翁益強，從診所不敢做、不知怎麼做，到順利讓數個診所投入、與南投醫院緊密合作，過程中發現不少問題。</p>
      <p><br/></p>
      <p>翁益強指出，開業的診所醫生不像醫院有社工師，團隊相對弱，13小時的教育訓練也讓很多人擔心只學到皮毛，且健保給付打七折、花費的時間多，真正敢做、願意做的診所不多。</p>
      <p><br/></p>
      <p>就算有心要做，基本的「武器」取得都有困難。舉例來說，想做替末期病人止痛所需的嗎啡因是管制藥，一般診所難以保管，馬上就「卡關」。<b>翁益強說，與醫院合作，能解決藥物的問題，團隊也可以透過開會共同討論病情、彼此間隨時互相支援，減少診所壓力；行政方面，他找了一位熟悉安寧療護的個案管理師，協助診所管理</b>。</p>
      <p><br/></p>
      <p>翁益強建議，現在雖規定診所做社區安寧療護，需要找一間「後援醫院」，但制度並沒有給後援醫院任何誘因，兩者之間只是一紙合約，沒有太實質的合作，應設法提供誘因增加醫院投入醫院，醫院、診所連結緊密，才能真正落實末期病人對「就近」的需求。</p>
      <p><br/></p>
      <h2>三、我不是癌症，但也想好好走完人生最後一哩路</h2>
      <p><br/></p>
      <div id="draw-1">
        <img class="lazyload hidden-md hidden-lg" :data-src="draw">
      </div>
      <p><br/></p>
      <p>從數據中發現，不論是癌症或非癌病人，在過世前一個月使用安寧療護的比率都是逐年提升，但非癌病人利用率明顯偏低、成長緩慢。</p>
      <p><br/></p>
      <p>翁益強指出，癌症有癌症防治法、有專責的資源和單位在管，推廣安寧觀念效果會很快速；<b>反觀非癌病人，死亡人口中雖有3／4病人是「非癌」，但不像癌症有專責的推廣單位，觀念提升的速度自然較慢</b>。</p>
      <p><br/></p>
      <p>此外，非癌病人相較癌症病人，疾病病程變數較大，仰賴臨床判斷，觀念上也不太會連結到安寧。不過翁益強認為，所謂的「變數大」，其實反映了醫生也需要教育，早期癌症治療也很多人反彈安寧，但現在觀念已慢慢推廣，當醫生都有安寧療護的觀念，就更能判斷何時需要安寧療護介入、真正幫助病人。</p>
    </ContentContainer>
    <Section id="section-3" :src="section3" :srcWeb="section3_web" text="醫生病人相對論：為什麼我們等不到彼此？"/>
    <ContentContainer background-color="#FFFFFF">
      <h2>一、要看病，到底難在哪？</h2>
      <p><br/></p>
      <p>依仰阿嬤（88），與年邁的先生同住在花蓮縣秀林鄉文蘭村重光部落，距離市區門諾等大醫院約40分鐘車程。三女兒謝美麗（Nanu）今年6月結束市區的美髮店生意，返家與父母同住。</p>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/xie.jpg" alt="">
        </div>
        <div class="people-name">
          病人家屬謝美麗
        </div>
      </div>
      <p><br/></p>
      <p>我媽有高血壓、心臟病、氣喘、呼吸中止等病史，9年前曾因心臟衰竭和肺積水住院治療。慢性病需要規律服藥，加上看眼科、骨科，一個禮拜至少要來回醫院兩次。</p>
      <p><br/></p>
      <p>要拿這些藥、看這些病，一定要去大醫院，家附近也沒有什麼小醫院或診所，主要都是去門諾醫院和慈濟醫院兩家。花蓮山區多數都沒有公車可搭，還沒有申請復康巴士的時候，只能叫計程車，單趟1000到1200元跑不掉。</p>
      <p><br/></p>
      <p><b>有錢也不一定叫得到車，我們住得遠，司機不一定願意來，或者要求加價；媽媽坐輪椅，需要無障礙計程車，車子更少。</b></p>
      <p><br/></p>
      <p>以前還沒回家住時，因為去醫院很麻煩，媽媽若不舒服，就把家裡不知道擺了多久的成藥、草藥拿出來隨便吃吃，或者挖出醫生很久前開的止痛藥吃，找到車子才能到市區看醫生。</p>
      <p><br/></p>
      <p>媽媽前幾年曾跟我妹妹在台北住了幾年，那時在台北馬偕醫院看醫生，好方便，坐捷運幾站就到，跟這裡差很多。</p>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/lin.jpg">
        </div>
        <div class="people-name">
          復康巴士司機林枝憲
        </div>
      </div>
      <p><br/></p>
      <p>偏鄉的老人家，住愈遠通常經濟狀況也愈差，很多更伴隨著獨居、老老照顧、隔代教養等多重困境，處境更加艱難。</p>
      <p><br/></p>
      <p>曾接過一個個案，家住在一個大陡坡上方，個案阿公和我說，全家只有他兒子有辦法推他出門、下坡、進城，若兒子不在，他就只能困在家中。</p>
      <p><br/></p>
      <p><b>花蓮面積4600多平方公里，北到南全長173公里，但全花蓮只有32輛復康巴士，卻有6500個個案有需求，供不應求</b>。花蓮大眾運輸不普及，有也都在台九線（主幹道）上，根本伸不進鄉鎮角落。</p>
      <p><br/></p>
      <p>我們不是專業護理人員，依規定不能到個案家中搬動個案，以免出事時責任歸屬難釐清。但有時候，<b>一些阿公阿嬤自己搭車看診，進門後會問「可不可以把我搬上床？」我幫了，就違反規定，但不幫，老人家就得在輪椅上坐到子女下班後才能上床</b>，看著他們的眼睛，怎麼忍心拒絕？</p>
      <p><br/></p>
      <p><br/></p>
      <div class="doctor">
        <div class="doctor-underline"></div>
        <div class="doctor-text">聽聽醫生怎麼說</div>
      </div>
      <p><br/></p>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/yu.jpg">
        </div>
        <div class="people-name">
          台灣在宅醫療學會理事長<br/>余尚儒
        </div>
      </div>
      <p><br/></p>
      <p><b>醫療是對應需求，你今天要活下去，多遠都要去</b>，偏鄉民眾為了就醫，往往需要花更高的交通費與時間成本。在山區看醫生，1個小時、1個半小時都是正常的。</p>
      <p><br/></p>
      <p>以我服務的台東縣東河鄉都蘭村為例，位處偏遠山區，植物人病患要緊急送醫，搭救護車到台東市區最近的醫院至少要1小時，單程就要花5000元。一般病患搭計程車，單趟也要500元。</p>
      <p><br/></p>
      <p>還有更多偏鄉居民，每個月得花上千元坐計程車往返醫院，就為了領慢性病藥，因為<b>整個東河鄉有9000人口，連一間健保藥局都沒有</b>。民眾要拿藥，只能舟車勞頓、花費昂貴車資跑到大醫院。</p>
      <p><br/></p>
      <p>城鄉醫療資源分布不均，偏鄉地區民眾雖然繳一樣的健保費，但都市與偏鄉享受到的醫療資源卻不一樣。且偏鄉青年人口流失，很多獨居老人、老老照顧，加上多屬經濟弱勢，更加深偏鄉醫療困境。</p>
      <p><br/></p>
      <div class="img-contain">
        <img class="lazyload hidden-md hidden-lg" src="./assets/3-1.jpg">
        <img class="lazyload hidden-xs hidden-sm" src="./assets/3-1_web.jpg">
      </div>
      <p><br/></p>
      <h2>二、好不容易看了病，拿藥也難</h2>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/xie.jpg">
        </div>
        <div class="people-name">
          病人家屬謝美麗
        </div>
      </div>
      <p><br/></p>
      <p>高血壓那些慢性病，可以拿慢性長期處方籤，醫生一次開三個月的藥，在醫院拿第一個月，後面兩個月就拿處方籤去藥局拿藥，不用常跑醫院。聽起來方便，但對我來說根本沒用。</p>
      <p><br/></p>
      <p>我家附近、甚至整個秀林鄉一間藥局，拿到處方籤，要去哪裡找後面兩個月的藥？還是得跑去市區。<p>
      <p><br/></p>
      <p><b>花蓮慈濟醫院每週四會有巡迴醫療來看診，我曾問過巡迴醫療的醫師，能不能在他（指巡迴醫療）這邊開藥、拿藥，他說沒辦法，他們沒有配備慢性病所需的藥品，不能隨便開，也沒辦法幫我們從醫院帶需要的藥過來。</b></p>
      <p><br/></p>
      <p><br/></p>
      <div class="doctor">
        <div class="doctor-underline"></div>
        <div class="doctor-text">聽聽醫生怎麼說</div>
      </div>
      <p><br/></p>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/yu.jpg">
        </div>
        <div class="people-name">
          台灣在宅醫療學會理事長<br/>余尚儒
        </div>
      </div>
      <p><br/></p>
      <p>偏鄉地區人口外移嚴重，藥師不願意到偏鄉開業，這就跟在鄉下開一家便利商店，容易虧損倒閉是一樣的道理，<b>市場競爭的結果，偏鄉社區型藥局生存不易</b>。可是如果所有醫療資源分配都由市場機制決定，偏鄉居民要怎麼活？目前政府也沒有提供補助或獎勵措施，難以吸引藥師到偏鄉開設藥局。</p>
      <p><br/></p>
      <p><b>現在偏鄉地區大多靠社區藥局的藥師送藥到府，減少民眾往返醫院領藥的不便</b>。不像傳統藥師多半在藥局等待患者上門，這些「行動藥師」步出藥局，走進老人家和行動不便病人的家中，送上慢性處方籤和提供藥物諮詢服務。不過，藥師外出送藥都沒有額外收入，完全是靠熱心、志願性提供服務。</p>
      <p><br/></p>
      <div class="img-contain">
        <img class="lazyload hidden-md hidden-lg" src="./assets/3-2.jpg">
        <img class="lazyload hidden-xs hidden-sm" src="./assets/3-2_web.jpg">
      </div>
      <p><br/></p>
      <h2>三、偏鄉醫療最需要的是什麼？</h2>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/xie.jpg" alt="">
        </div>
        <div class="people-name">
          病人家屬謝美麗
        </div>
      </div>
      <p><br/></p>
      <p>最需要的當然還是交通要方便，或者是要能有就近看病、拿藥的地方。</p>
      <p><br/></p>
      <p>有復康巴士是很好，但不好預約，而且看醫生的時間很難預料，有些醫生會體諒你、知道你要趕車，讓你先看，但這樣的醫生是少數。有時候醫生叫我們轉診到其他科，一轉就轉半天，趕不上巴士怎麼辦？</p>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/lin.jpg">
        </div>
        <div class="people-name">
          復康巴士司機林枝憲
        </div>
      </div>
      <p><br/></p>
      <p>政府統計說花蓮居民平均擁有的病床數、醫護人員人數多，但花蓮所有醫療資源都集中在花蓮市和吉安鄉，鄉鎮間差異很大，近的去醫院很快，遠的要看個病難如登天，醫療資源要深入到每個聚落、分布均勻。</p>
      <p><br/></p>
      <p><br/></p>
      <div class="doctor">
        <div class="doctor-underline"></div>
        <div class="doctor-text">聽聽醫生怎麼說</div>
      </div>
      <p><br/></p>
      <p><br/></p>
      <div class="people">
        <div class="people-img">
          <img src="./assets/yu.jpg">
        </div>
        <div class="people-name">
          台灣在宅醫療學會理事長<br/>余尚儒
        </div>
      </div>
      <p><br/></p>
      <p><b>偏鄉地區不一定需要蓋大醫院，要解決偏鄉就醫可近性的問題，最重要的是要廣設基層社區診所，讓診所有「一站式」的功能</b>，除了看診外，還可以提供基本檢查服務，像是超音波、胃鏡等，日本鄉下衛生所都有這些設備，偏鄉民眾就不用為了做檢查跑到大醫院。</p>
      <p><br/></p>
      <p>但是目前診所並沒有發揮應有的功能，原因是健保給付制度對基層診所不利，診所購入醫療儀器無法獲得給付，醫師當然不願意進。很多藥物規定一定要做檢查才能開立，像失智症鑑定一定要到醫院，診所不能開失智症藥物，但是鄉下的失智症長輩要怎麼去醫院？怎麼定期回診？理論上，應該讓有認證的偏鄉診所就能開藥，才能讓當地民眾就醫需求就近獲得解決。</p>
      <p><br/></p>
      <p>要讓醫師願意到偏鄉開業，就必須<b>提高給付，讓偏鄉醫師能夠生存，才能真正解決就醫可近性的問題</b>。偏鄉基層照護，包括檢查、用藥，只要診所能做，就應該按照醫院給付，甚至是提供更好的條件。或是有一些獎勵措施，例如願意到偏鄉開藥局，政府就幫忙付藥局租金，必須提供足夠誘因，這樣才有醫師願意做。</p>
      <p><br/></p>
      <Share href="https://udn.com/upf/newmedia/2018_data/rural_medical/index.html"/>
      <Logo />
      <p><br/></p>
      <Editor>
        <div>製作人、文字：林秀姿、洪欣慈、蔡佩蓉</div>
        <div>視覺設計：許瑋琳</div>
        <div>攝影：林俊良</div>
        <div>網頁製作：鄭偉廷</div>
        <div>監製：董谷音、蔡幸怡</div>
        <div>2018.01.</div>
        <a href="https://drive.google.com/drive/folders/1ct46pOKKLWETsLBMXwY0SugBVS2qqB8U" target="_blank"><div id="refer">原始資料來源</div></a>
      </Editor>
			<p><br/></p>
      <p><br/></p>
      <Question href="https://www.surveycake.com/s/KpQKN" text="填寫閱讀體驗問卷"/>
      <p><br/></p>
      <p><br/></p>
      <Relate>
				<a href="./wang.html" target="_blank" slot="relate-1">
					<img class="lazyload" data-src="https://udn.com/upf/newmedia/image/projects/201712_taipei-railway-workshop.jpg"/>
					<p>遷不走的火車職人魂 360VR看82歲的台北機廠</p>
				</a>
				<a href="./xie.html" target="_blank" slot="relate-2">
					<img class="lazyload" data-src="https://udn.com/upf/newmedia/image/projects/201711_farewell.jpg"/>
					<p>好好說再見 插畫記林杰樑走後1500天</p>
				</a>
				<a href="./ding.html" target="_blank" slot="relate-3">
					<img class="lazyload" data-src="https://udn.com/upf/newmedia/image/projects/201710_ideal.jpg"/>
					<p>人人90歲的時代 你想怎麼活？</p>
				</a>
				<a href="./check.html" target="_blank" slot="relate-4">
					<img class="lazyload" data-src="https://udn.com/upf/newmedia/image/projects/201710_poverty.jpg"/>
					<p>被遺忘的孩子 我8歲，我住貨櫃屋</p>
				</a>
			</Relate>
      <p><br/></p>
			<FBComment href="https://udn.com/upf/newmedia/2018_data/rural_medical/index.html" />
      <p><br/></p>
      <Foot/>
    </ContentContainer>
  </div>
</template>

<script>

import Cover from '@/components/CoverFixedBg'
import Section from '@/components/Section'
import HeadBar from '@/components/HeadBar'
import Question from '@/components/Question'
import { Indicator, ContentContainer, Quote, Share, Editor, Relate, FBComment, Foot, Logo } from 'udn-newmedia-vue-components'

import bg from '@/assets/bg.jpg'
import bg_web from '@/assets/bg_web.png'

import section1 from '@/assets/section1.jpg'
import section2 from '@/assets/section2.jpg'
import section3 from '@/assets/section3.jpg'
import section1_web from '@/assets/section1_web.jpg'
import section2_web from '@/assets/section2_web.jpg'
import section3_web from '@/assets/section3_web.jpg'

import pharmacy1 from '@/assets/pharmacy1.png'
import pharmacy2 from '@/assets/pharmacy2.png'

import draw from '@/assets/draw.gif'

var svg, circle, prj, path
var pagePadding = 50

var country_data = {
        '新北市':{population: 3979208, old: 465909, hospital: 10, beds: 44, employee: 68, x: '-108px', y: '164px', cancer: 6750, noresource: 11, dessert: 37.9},
        '臺北市':{population: 2695704, old: 419130, hospital: 20, beds: 93, employee: 168, x: '-108px', y: '174px', cancer: 5219, noresource: 0, dessert: 0},
        '桃園市':{population: 2147763, old: 219425, hospital: 9, beds: 70, employee: 96, x: '-64px', y: '147px', cancer: 3231, noresource: 4, dessert: 30.7},
        '臺中市':{population: 2767239, old: 301994, hospital: 16, beds: 76, employee: 115, x: '-5px', y: '53px', cancer: 4877, noresource: 13, dessert: 44.8},
        '臺南市':{population: 1886033, old: 259701, hospital: 10, beds: 68, employee: 108, x: '65px', y: '-109px', cancer: 4352, noresource: 24, dessert: 64.8},
        '高雄市':{population: 2779371, old: 373604, hospital: 10, beds: 78, employee: 120, x: '43px', y: '-161px', cancer: 6112, noresource: 26, dessert: 68.4},
        '宜蘭縣':{population: 457538, old: 67798, hospital: 3, beds: 85, employee: 98, x: '-115px', y: '115px', cancer: 1061, noresource: 4, dessert: 33.3},
        '新竹縣':{population: 547481, old: 64040, hospital: 1, beds: 44, employee: 51, x: '-45px', y: '122px', cancer: 836, noresource: 9, dessert: 69.2},
        '苗栗縣':{population: 559189, old: 82771, hospital: 3, beds: 59, employee: 64, x: '-17px', y: '94px', cancer: 1288, noresource: 12, dessert: 66.6},
        '彰化縣':{population: 1287146, old: 182962, hospital: 5, beds: 59, employee: 90, x: '49px', y: '5px', cancer: 2904, noresource: 7, dessert: 26.9},
        '南投縣':{population: 505163, old: 80135, hospital: 1, beds: 65, employee: 73, x: '-17px', y: '-14px', cancer: 1215, noresource: 2, dessert: 15.3},
        '雲林縣':{population: 694873, old: 118764, hospital: 5, beds: 56, employee: 73, x: '56px', y: '-23px', cancer: 2026, noresource: 8, dessert: 40},
        '嘉義縣':{population: 515320, old: 92234, hospital: 1, beds: 66, employee: 83, x: '45px', y: '-54px', cancer: 1666, noresource: 1, dessert: 5.5},
        '屏東縣':{population: 835792, old: 127016, hospital: 7, beds: 68, employee: 86, x: '26px', y: '-222px', cancer: 2148, noresource: 8, dessert: 24.2},
        '臺東縣':{population: 220802, old: 33060, hospital: 1, beds: 68, employee: 89, x: '-29px', y: '-172px', cancer: 672, noresource: 11, dessert: 68.7},
        '花蓮縣':{population: 330911, old: 46329, hospital: 3, beds: 132, employee: 130, x: '-80px', y: '-25px', cancer: 800, noresource: 6, dessert: 50},
        '澎湖縣':{population: 103263, old: 15579, hospital: 0, beds: 53, employee: 64, x: '144px', y: '-32px', cancer: 250, noresource: 5, dessert: 83.3},
        '基隆市':{population: 372100, old: 51949, hospital: 3, beds: 78, employee: 91, x: '-121px', y: '185px', cancer: 750, noresource: 5, dessert: 71.4},
        '新竹市':{population: 437337, old: 48141, hospital: 2, beds: 64, employee: 115, x: '-18px', y: '128px', cancer: 738, noresource: 1, dessert: 33.3},
        '嘉義市':{population: 269874, old: 36268, hospital: 5, beds: 146, employee: 198, x: '59px', y: '-59px', cancer: 601, noresource: 0, dessert: 0},
        '金門縣':{population: 135114, old: 15769, hospital: 0, beds: 28, employee: 29, x: '116px', y: '132px', cancer: 221, noresource: 5, dessert: 83.3},
        '連江縣':{population: 12595, old: 1287, hospital: 0, beds: 41, employee: 62, x: '116px', y: '132px', cancer: 13, noresource: 4, dessert: 100}
  }

var resouce_leak = ["三重區","蘆洲區","八里區","五股區","林口區","泰山區","竹北市","新豐鄉","湖口鄉","新埔鎮","竹東鎮","寶山鄉","北埔鄉","峨眉鄉","芎林鄉","橫山鄉","關西鎮","尖石鄉","五峰鄉","後龍鎮","西湖鄉","通霄鎮","苑裡鎮","竹南鎮","頭份市","三灣鄉","南庄鄉","造橋鄉","芳苑鄉","二林鎮","埤頭鄉","竹塘鄉","大城鄉","田中鎮","二水鄉","田尾鄉","北斗鎮","溪州鄉","埔里鎮","仁愛鄉","魚池鄉","國姓鄉","草屯鎮","南投市","名間鄉","中寮鄉","竹山鎮","鹿谷鄉","集集鎮","水里鄉","信義鄉","口湖鄉","北港鎮","水林鄉","元長鄉","四湖鄉","虎尾鎮","大埤鄉","土庫鎮","西螺鎮","二崙鄉","崙背鄉","褒忠鄉","臺西鄉","東勢鄉","麥寮鄉","斗六市","林內鄉","莿桐鄉","古坑鄉","斗南鎮","民雄鄉","竹崎鄉","番路鄉","中埔鄉","阿里山鄉","大埔鄉","梅山鄉","大林鎮","溪口鄉","新港鄉","朴子市","六腳鄉","東石鄉","布袋鎮","太保市","鹿草鄉","義竹鄉","旗山區","美濃區","六龜區","甲仙區","杉林區","內門區","茂林區","桃源區","那瑪夏區","枋寮鄉","春日鄉","枋山鄉","獅子鄉","恆春鎮","車城鄉","滿洲鄉","牡丹鄉","馬公市","湖西鄉","白沙鄉","西嶼鄉","望安鄉","七美鄉","關山鎮","池上鄉","海端鄉","鹿野鄉","延平鄉","成功鎮","長濱鄉","東河鄉","大武鄉","達仁鄉","金峰鄉","太麻里鄉","萬榮鄉","鳳林鎮","光復鄉","豐濱鄉","玉里鎮","富里鄉","卓溪鄉","瑞穗鄉"]
var pharmacy_leak = ["南化區", "龍崎區", "田寮區", "永安區", "茂林區", "桃源區", "那瑪夏區", "坪林區", "平溪區", "貢寮區", "烏來區", "橫山鄉", "峨眉鄉", "五峰鄉", "大同鄉", "造橋鄉", "三灣鄉", "獅潭鄉", "泰安鄉", "鹿谷鄉", "中寮鄉", "大埔鄉", "滿州鄉", "三地門鄉", "霧臺鄉", "泰武鄉", "來義鄉", "獅子鄉", "牡丹鄉", "豐濱鄉", "富里鄉", "秀林鄉", "萬榮鄉", "卓溪鄉", "大武鄉", "東河鄉", "綠島鄉", "延平鄉", "海瑞鄉", "達仁鄉", "金峰鄉", "蘭嶼鄉", "白沙鄉", "望安鄉", "七美鄉", "金寧鄉", "烈嶼鄉", "烏坵鄉", "南竿鄉", "北竿鄉", "莒光鄉", "東引鄉"]
var dessert_leak = ["基隆市", "新竹縣", "臺東縣", "高雄市", "苗栗縣"]
var dessert_rich = ["臺北市", "嘉義市"]
var old_town = ["坪林區", "平溪區", "貢寮區", "橫山鄉", "峨眉鄉", "三灣鄉", "獅潭鄉", "鹿谷鄉", "中寮鄉", "南化區", "龍崎區", "田寮區", "豐濱鄉", "富里鄉", "東河鄉"]

export default {
  name: 'app',
  data: function(){
    return {
      main: [
        {id: 0, location: '新北市', population: 3979208, old: 465909, hospital: 10, beds: 44, employee: 68, x: '-108px', y: '164px', cancer: 6750, noresource: 11, dessert: 37.9},
        {id: 1, location: '臺北市', population: 2695704, old: 419130, hospital: 20, beds: 93, employee: 168, x: '-108px', y: '174px', cancer: 5219, noresource: 0, dessert: 0},
        {id: 2, location: '桃園市', population: 2147763, old: 219425, hospital: 9, beds: 70, employee: 96, x: '-64px', y: '147px', cancer: 3231, noresource: 4, dessert: 30.7},
        {id: 3, location: '臺中市', population: 2767239, old: 301994, hospital: 16, beds: 76, employee: 115, x: '-5px', y: '53px', cancer: 4877, noresource: 13, dessert: 44.8},
        {id: 4, location: '臺南市', population: 1886033, old: 259701, hospital: 10, beds: 68, employee: 108, x: '65px', y: '-109px', cancer: 4352, noresource: 24, dessert: 64.8},
        {id: 5, location: '高雄市', population: 2779371, old: 373604, hospital: 10, beds: 78, employee: 120, x: '43px', y: '-161px', cancer: 6112, noresource: 26, dessert: 68.4},
        {id: 6, location: '宜蘭縣', population: 457538, old: 67798, hospital: 3, beds: 85, employee: 98, x: '-115px', y: '115px', cancer: 1061, noresource: 4, dessert: 33.3},
        {id: 7, location: '新竹縣', population: 547481, old: 64040, hospital: 1, beds: 44, employee: 51, x: '-45px', y: '122px', cancer: 836, noresource: 9, dessert: 69.2},
        {id: 8, location: '苗栗縣', population: 559189, old: 82771, hospital: 3, beds: 59, employee: 64, x: '-17px', y: '94px', cancer: 1288, noresource: 12, dessert: 66.6},
        {id: 9, location: '彰化縣', population: 1287146, old: 182962, hospital: 5, beds: 59, employee: 90, x: '49px', y: '5px', cancer: 2904, noresource: 7, dessert: 26.9},
        {id: 10, location: '南投縣', population: 505163, old: 80135, hospital: 1, beds: 65, employee: 73, x: '-17px', y: '-14px', cancer: 1215, noresource: 2, dessert: 15.3},
        {id: 11, location: '雲林縣', population: 694873, old: 118764, hospital: 5, beds: 56, employee: 73, x: '56px', y: '-23px', cancer: 2026, noresource: 8, dessert: 40},
        {id: 12, location: '嘉義縣', population: 515320, old: 92234, hospital: 1, beds: 66, employee: 83, x: '45px', y: '-54px', cancer: 1666, noresource: 1, dessert: 5.5},
        {id: 13, location: '屏東縣', population: 835792, old: 127016, hospital: 7, beds: 68, employee: 86, x: '26px', y: '-222px', cancer: 2148, noresource: 8, dessert: 24.2},
        {id: 14, location: '臺東縣', population: 220802, old: 33060, hospital: 1, beds: 68, employee: 89, x: '-29px', y: '-172px', cancer: 672, noresource: 11, dessert: 68.7},
        {id: 15, location: '花蓮縣', population: 330911, old: 46329, hospital: 3, beds: 132, employee: 130, x: '-80px', y: '-25px', cancer: 800, noresource: 6, dessert: 50},
        {id: 16, location: '澎湖縣', population: 103263, old: 15579, hospital: 0, beds: 53, employee: 64, x: '144px', y: '-32px', cancer: 250, noresource: 5, dessert: 83.3},
        {id: 17, location: '基隆市', population: 372100, old: 51949, hospital: 3, beds: 78, employee: 91, x: '-121px', y: '185px', cancer: 750, noresource: 5, dessert: 71.4},
        {id: 18, location: '新竹市', population: 437337, old: 48141, hospital: 2, beds: 64, employee: 115, x: '-18px', y: '128px', cancer: 738, noresource: 1, dessert: 33.3},
        {id: 19, location: '嘉義市', population: 269874, old: 36268, hospital: 5, beds: 146, employee: 198, x: '59px', y: '-59px', cancer: 601, noresource: 0, dessert: 0},
        {id: 20, location: '金門縣', population: 135114, old: 15769, hospital: 0, beds: 28, employee: 29, x: '116px', y: '132px', cancer: 221, noresource: 5, dessert: 83.3},
        {id: 21, location: '連江縣', population: 12595, old: 1287, hospital: 0, beds: 41, employee: 62, x: '116px', y: '132px', cancer: 13, noresource: 4, dessert: 100}
      ],
      bg: bg,
      bg_web: bg_web,
      section1: section1,
      section2: section2,
      section3: section3,
      section1_web: section1_web,
      section2_web: section2_web,
      section3_web: section3_web,
      pharmacy1: pharmacy1,
      pharmacy2: pharmacy2,
      draw: draw,
      mapTranslate: {
        x: '0',
        y: '0'
      },
      part2: false,
      mapShow: false,
      mapScale: false,
      mapScaleBig: false,
      mapmenu: false,
      mapSelect: false,
      tooltipShow: false,
      tooltipShow2: false,
      boardShow: false,
      selectedText: '選擇縣市',
      selectedCountry: {location: '總計', population: 23539816, old: 3106105, hospital: 115, beds: 69, employee: 103, cancer: 0, noresource: 0, dessert: 71.4},
      mapcontent: '',
      mapsay: '',
      mapsource: '',
      mapmark: '',
      mapremark: '',
      mapSayShow: true,
      mapMarkHidden: true,
      mapMarkHidden2: true,
      mapmarks: '',
      ext: false
    }
  },
  mounted: function(){

    window.addEventListener('scroll', this.handleScroll)

    var w = $(window).width()
    var h = $(window).height()
    var xPadding = 0
    var yPadding = 0
    var svg_w, svg_h

    if(w > 1024){
      svg_w = 375
      svg_h = 667
      $('.mask').css('opacity', 0)
    }
    else{
      svg_w = 375
      svg_h = 667
    }

    if(w > 375){
      xPadding = 0
      yPadding = 0
    }

    svg = d3.select('#map').append('svg').attr({'width' : svg_w, 'height': svg_h});

    svg.append('image').attr({'xlink:href': './static/taiwan.png', 'x': 28, 'y': -3, 'width': svg_w, 'height': svg_h})

    prj = d3.geo.mercator().center([120.971864, 23.400998])
        .scale(7800).translate([svg_w/2 + 30, svg_h/2 + 50]);

    path = d3.geo.path().projection(prj);

    d3.json('./static/towns-63.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-64.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-65.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-66.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-67.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-68.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10002.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10004.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10005.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10007.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10008.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10009.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10010.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10013.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10014.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10015.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10016.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10017.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10018.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json('./static/towns-10020.json', function(data){

      var topo = topojson.feature(data, data.objects.map)

      var g = svg.append('g')

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'town'
          if(resouce_leak.indexOf(d.properties.name) != -1){
            temp += ' leak'
          }
          if(pharmacy_leak.indexOf(d.properties.name) != -1){
            temp += ' pharmacy'
          }
          if(old_town.indexOf(d.properties.name) != -1){
            temp += ' old'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .append('svg:title')
          .text(function(d){
            return d.properties.name
          })
    })

    d3.json("./static/counties.json", function(data){
      
      var topo = topojson.feature(data, data.objects.map);

      var g = svg.append('g').attr('id', 'map-g');

      g.selectAll('path')
        .data(topo.features)
        .enter()
        .append('path')
        .attr('d', path)
        .attr('class', function(d){
          var temp = 'country'
          if(dessert_leak.indexOf(d.properties.name) != -1){
            temp += ' dessert'
          }
          if(dessert_rich.indexOf(d.properties.name) != -1){
            temp += ' rich'
          }
          return temp
        })
        .attr('id', function(d){
          return d.properties.name
        })
        .attr('fill', function(d){
          return '#EF4326';
        })
        .attr('fill-opacity', '0')
        .attr('stroke', '#B5B5B6')
        .attr('stroke-opacity', '1')
        .attr('stroke-width', '0.5')

        svg.append('g')
        .append('path')
        .attr('id', 'test')
        .attr('class', 'road')
        .attr('d', "M263.7,409.2v-2.1v-2.4l-2-0.7c0,0-0.6-1,0.3-1.6c0.9-0.7,2.4-1.5,2.4-1.5l1.4-2c0,0,0.4-2.3,0.6-2.8c0.1-0.5,0-2,0-2l0.4-1.4v-1.1c0,0,1.2-1.3,1.3-2.8c0-1.4,0.7-4.6,0.9-5.2c0.3-0.5,1.9-2.9,1.9-2.9v-1.5c0,0,4-4.6,4.2-4.8c0.2-0.2,0.3-2.6,0.4-3.3c0.1-0.7-0.7-1.5-1.3-2c-0.6-0.5-1.1-1.1-1.3-2.1s-0.7-2.5-0.9-3.5s-0.2-2.2,0.1-3c0.3-0.8,0.6-1.8,0.6-2.7c0-1-0.1-2.1,0.2-2.9c0.4-0.8,1.1-2.1,1.4-3.2c0.3-1,2-3.1,2.3-4c0.3-0.9,1.8-3.9,1.4-4.8c-0.4-1-1.5-1.3-1.6-2s-0.2-1.7,0.3-2.4s1.3-1.2,1.7-2c0.4-0.8,1.3-1.6,1.6-1.7s1.2-1.5,1.3-1.9s1-0.4,0.9-1.8c-0.1-1.4,0.2-2.2,0.4-2.9c0.2-0.7,0.9-2,0.9-2.7s-0.6-2.2,0.4-3.1c1-0.9,1.7-0.2,2.2-0.5c0.6-0.3,2.7-0.9,2.8-1.4s6-9.5,6-9.5s0.8-0.9,2.7-2.2c2-1.3,3.6-3.7,3.6-3.7s0-1.3,0.3-2.5c0.2-1.1,4.2-6.6,4.2-6.6")

        svg.append('g')
          .append('path')
          .attr('id', 'test2')
          .attr('class', 'road')
          .attr('d', "M239.4,479.1l-2.7-1.1c0,0,0,0,0-0.1l0.1-1.2c0,0,0-0.1-0.1-0.1l-2.7-0.6c-0.1,0-0.1-0.1,0-0.1l0.8-0.3c0,0,0.1-0.1,0-0.1l-2-2.1c0,0,0,0,0,0v-0.7c0,0,0,0,0,0l0.4-0.6c0,0,0,0,0-0.1l-0.4-1.3c0,0,0,0,0,0l-0.4-0.5c0,0,0,0,0-0.1l0.7-2.2c0,0,0,0,0,0l-0.1-2.4c0,0,0,0,0,0l-0.2-1.5c0,0,0,0,0,0l0.3-1c0,0,0,0,0,0l0.6-0.5c0,0,0,0,0-0.1c0-0.2,0-1.1,0.1-1.4c0.1-0.3,0.9-0.9,0.8-1.1c-0.1-0.2-0.8-0.2-0.9-0.3c0,0,0,0,0,0l-0.6-0.5c0,0,0,0,0-0.1c0-0.2,0.2-1.4,0.5-1.5c0.3,0,1.7,0,2,0c0,0,0.1,0,0.1,0l0.3-1c0,0,0,0,0,0v-1.4c0,0,0,0,0,0c0.1-0.2,1-1.2,0.8-1.3c-0.2-0.1-0.4-0.2-0.5-0.2c0,0,0,0,0-0.1l0.4-1.6c0,0,0,0,0,0l0.8-0.9c0,0,0,0,0,0l0.4-1.1c0,0,0,0,0,0l0-0.8c0,0,0,0,0,0l6.4-17.9c0,0,0,0,0,0l0.1-1.8c0,0,0,0,0-0.1l2.6-1.7c0,0,0.1,0,0.1,0.1v0.5c0,0,0,0.1,0.1,0.1h1")

      svg.append('g')
        .append('path')
        .attr('id', 'test3')
        .attr('class', 'road')
        .attr('d', "M194.1,598.3c0,0,0.2,0-1.8-0.5c-2-0.5-2.4-0.9-3.6-2.6s-1.6-4.1-2.2-5.1s0.1-1.9,0-3.2c-0.1-1.4-1.8-3.4-2.8-4.7s-1.3-1.9-0.9-4.3c0.4-2.5-0.5-5.4-1.1-6.6c-0.6-1.2-0.8-1.7-1.3-4.3c-0.5-2.6-1.4-6.5-1.4-6.5s-2.6-4.6-3.7-6c-1.1-1.4-1.4-3.8-1.8-6.3c-0.4-2.5-2.8-5.6-4.1-6.8c-1.3-1.1-1.5-3.9-1.6-4.8c-0.1-1-1.7-3.6-1.7-3.6l-1.5-2l-4-1.7l-4.6-2.5l-3.1-3.1l-6.2-2.1")

        d3.csv('./static/hospital.csv', function(data){
          circle = svg.selectAll('circle')
            .data(data).enter()
            .append('circle')
            .attr({
              'cx': function(d){
                return prj([d.lat, d.lon])[0]
              },
              'cy': function(d){
                return prj([d.lat, d.lon])[1]
              },
              'id': function(d){
                return d.name
              },
              'class': function(d){
                return d.location.substr(0, 3) + ' point'
              },
              'r': 0,
            })
            

          svg.append('circle')
            .attr({
              'cx': function(d){
                return prj([121.31118, 23.2209221])[0]
              },
              'cy': function(d){
                return prj([121.31118, 23.2209221])[1]
              },
              'id': '六十石山',
              'class': 'point-s map1',
              'r': 2
            })

            svg.append('text')
                .attr({
                  'x': 277,
                  'y': 336,
                  'class': 'road-text map1',
                })
                .text('2小時21分')
            svg.append('text')
                .attr({
                  'x': 272,
                  'y': 345,
                  'class': 'road-text map1',
                })
                .text('106公里')

            svg.append('text')
                .attr({
                  'x': 304,
                  'y': 124,
                  'class': 'road-text map4',
                })
                .text('6分')
            svg.append('text')
                .attr({
                  'x': 314,
                  'y': 134,
                  'class': 'road-text map4',
                })
                .text('2.3公里')

            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([121.6263725, 23.9878102])[0]
                  },
                  'y': function(d){
                    return prj([121.6263725, 23.9878102])[1]
                  },
                  'class': 'svg-text map1',
                })
                .text('門諾醫院')

            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([121.31118, 23.2209221])[0]
                  },
                  'y': function(d){
                    return prj([121.31118, 23.2209221])[1]
                  },
                  'class': 'svg-text map1',
                })
                .text('花蓮六十石山')

            svg.append('circle')
                .attr({
                  'cx': function(d){
                    return prj([121.2044414, 23.0973841])[0]
                  },
                  'cy': function(d){
                    return prj([121.2044414, 23.0973841])[1]
                  },
                  'id': '金城武樹',
                  'class': 'point-s map2',
                  'fill': 'teal',
                  'r': 2
                })

            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([121.2044414, 23.0973841])[0]
                  },
                  'y': function(d){
                    return prj([121.2044414, 23.0973841])[1]
                  },
                  'class': 'svg-text map2',
                })
                .text('金城武樹')
            
            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([121.1408337, 22.7511439])[0]
                  },
                  'y': function(d){
                    return prj([121.1408337, 22.7511439])[1]
                  },
                  'class': 'svg-text map2',
                })
                .text('馬偕醫院')

             svg.append('text')
                .attr({
                  'x': 237,
                  'y': 447,
                  'class': 'road-text map2',
                })
                .text('1小時11分')
            svg.append('text')
                .attr({
                  'x': 232,
                  'y': 456,
                  'class': 'road-text map2',
                })
                .text('52公里')

            svg.append('circle')
                .attr({
                  'cx': function(d){
                    return prj([120.7979742, 21.9452566])[0]
                  },
                  'cy': function(d){
                    return prj([120.7979742, 21.9452566])[1]
                  },
                  'id': '墾丁大街',
                  'class': 'point-s map3',
                  'r': 2
                })

            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([120.7979742, 21.9452566])[0]
                  },
                  'y': function(d){
                    return prj([120.7979742, 21.9452566])[1]
                  },
                  'class': 'svg-text map3',
                })
                .text('墾丁大街')
            
            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([120.453052, 22.465312])[0]
                  },
                  'y': function(d){
                    return prj([120.453052, 22.465312])[1]
                  },
                  'class': 'svg-text map3',
                })
                .text('輔英科大附設醫院')

            svg.append('text')
                .attr({
                  'x': 215,
                  'y': 547,
                  'class': 'road-text map3',
                })
                .text('1小時31分')
            svg.append('text')
                .attr({
                  'x': 210,
                  'y': 556,
                  'class': 'road-text map3',
                })
                .text('75公里')

            svg.append('circle')
                .attr({
                  'cx': function(d){
                    return prj([121.5372118, 25.0385771])[0]
                  },
                  'cy': function(d){
                    return prj([121.5372118, 25.0385771])[1]
                  },
                  'id': '大安',
                  'class': 'point-s map4',
                  'r': 2
                })

            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([121.7272118, 25.0385771])[0]
                  },
                  'y': function(d){
                    return prj([121.7272118, 25.0385771])[1]
                  },
                  'id': 'dibow',
                  'class': 'svg-text map4',
                })
                .text('大安森林公園')
            
            svg.append('text')
                .attr({
                  'x': function(d){
                    return prj([121.518969, 25.0406784])[0]
                  },
                  'y': function(d){
                    return prj([121.518969, 25.0406784])[1]
                  },
                  'class': 'svg-text map4',
                })
                .text('台大醫院')

      })
    })

    setTimeout(() => {
      $('.country').on('mouseenter', this.handleMouseEnter)
      $('.country').on('mouseout', this.handleMouseOut)
    }, 1000)

    

  },
  methods: {
    handleMouseOut: function(){
      this.tooltipShow = false
    },
    handleMouseEnter: function(d){
      for(var i = 0; i < this.main.length; i++){
        if(this.main[i].location == d.currentTarget.id){
          $('.point').css('stroke', 'none')
          $('.' + this.main[i].location).css('stroke', '#000000')
          this.selectedCountry = this.main[i]
          break;
        }
      }
      if(this.part2 != true){
        this.tooltipShow = true
      }
      
    },
    menuClick: function(d){
      if(d == 21 || d == 20){
        this.ext = true
      }
      this.mapmenu = false
      this.selectedText = this.main[d].location
      this.selectedCountry = this.main[d]
      if(this.part2 == true){
        this.tooltipShow2 = true
      }
      else{
        this.tooltipShow = true
      }
      this.mapScale = true
      this.mapTranslate.x = this.main[d].x
      this.mapTranslate.y = this.main[d].y
      $('.point').css('stroke', 'none')
      $('.' + this.main[d].location).css('stroke', '#000000')
    },
    handleScroll: function(e){
      var currentH = window.pageYOffset
      var map = currentH - $('#map-contain').offset().top + window.innerHeight
      var transformPadding = 0
      var webPadding = 0
      if(window.innerHeight < 800 && window.innerWidth > 1024){
        transformPadding = -40
      }

      if(window.innerWidth > 1024){
        webPadding = window.innerHeight / 2
      }

      $('.doctor-underline').each(function(){
        if(currentH + window.innerHeight > $(this).offset().top){
          $(this).addClass('max')
        }
        
      })
      console.log(currentH)
      if(map < window.innerHeight - 200){
        this.mapShow = false
        this.mapSelect = false
        this.mapmenu = false
        this.mapSayShow = false
        this.mapMarkHidden = true
        this.mapcontent = ''
        this.mapsay = ''
        this.mapsource = ''
        this.mapmark = ''
        this.mapremark = ''
        this.ext = false
        this.mapMarkHidden = true
        $('.town').css('stroke-opacity', '0')
        circle.transition().attr({'r': 0})
        $('#svg-contain').css('z-index', '')
        $('#map-board-ss').css('opacity', '')
        $('#map-tooltip').css('z-index', '')
        $('#map-say').css('z-index', '')
        this.tooltipShow2 = false
      }
      else if(map >= window.innerHeight - 200 && map < window.innerHeight * 2){
        this.mapShow = true
        this.mapSayShow = true
        this.mapSelect = true
        this.mapScale = false
        this.tooltipShow = false
        this.mapTranslate.x = 0
        this.mapTranslate.y = 0
        this.mapMarkHidden = false
        this.mapcontent = '破解數字迷思 從地圖看偏鄉就醫的苦'
        this.mapsay = '資料來源：衛生福利部'
        this.mapsource = '統計時間：2016年底'
        this.mapmark = '醫學中心、區域醫院'
        this.mapremark = '註：一家醫院若有兩個院區，在地圖上以兩個點分別標示，並計為兩家醫院。'
        $('.town').css('stroke-opacity', '0')
        $('#leave .town').css('stroke-opacity', '1')
        $('.leak').css('fill-opacity', '0')
        $('#map-board-s').css('opacity', '0')
        $('.point').css('fill', '')
        if(window.innerWidth > 1024){
          $('#svg-contain').css('z-index', '1')
          $('#map-tooltip').css('z-index', '2')
          $('#map-say').css('z-index', '2')
        }
        this.ext = false
        circle.transition().attr({'r': 2})
        $('#map-board-ss').css('opacity', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight/2 >= $('#r-1').offset().top + webPadding && currentH + window.innerHeight < $('#r-3').offset().top + pagePadding){
        this.mapShow = false
        this.mapSayShow = false
        this.mapSelect = false
        this.mapScale = true
        this.tooltipShow = false
        this.mapmenu = false
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-110px'
          this.mapTranslate.y = Number(80 + transformPadding) + 'px'
        }
        else{
          this.mapTranslate.x = '-98px'
          this.mapTranslate.y = '-15px'
        }
        $('#map-board-s').css('opacity', '1')
        $('.town').css('stroke-opacity', '0')
        $('.leak').css('fill-opacity', '0')
        $('.point-s').css('opacity', '0')
        $('#國軍花蓮總醫院附設民眾診療服務處').attr('r', 2)
        $('#佛教慈濟醫療財團法人花蓮慈濟醫院').attr('r', 2)
        $('#臺灣基督教門諾會醫療財團法人門諾醫院').attr('r', 2)
        $('.country').css('fill-opacity', '')
        $('.point').css('fill', 'none')
        $('#國軍花蓮總醫院附設民眾診療服務處').css('fill', '')
        $('#佛教慈濟醫療財團法人花蓮慈濟醫院').css('fill', '')
        $('#臺灣基督教門諾會醫療財團法人門諾醫院').css('fill', '')
        $('.point-s').css('fill', '')
        $('.road').css('stroke-dashoffset', '')
        $('.svg-text').css('opacity', 0)
        $('.road-text').css('opacity', 0)
        this.ext = false
        this.mapMarkHidden2 = true
        $('#svg-contain').css('z-index', '')
        $('#map-board-ss').css('opacity', '')
        $('#map-tooltip').css('z-index', '')
        $('#map-say').css('z-index', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-3').offset().top + pagePadding && currentH + window.innerHeight < $('#r-4').offset().top + pagePadding){
        this.mapScale = true
        this.tooltipShow = false
        this.mapMarkHidden = true
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-86px'
          this.mapTranslate.y = Number(80 + transformPadding) + 'px'
        }
        else{
          this.mapTranslate.x = '-86px'
          this.mapTranslate.y = '-40px'
        }
        this.mapSayShow = true
        this.mapmark = '資料來源 Google Map'
        this.mapsay = ''
        this.mapsource = ''
        this.mapremark = ''
        this.mapmenu = false
        $('#map-board-s').css('opacity', '0')        
        $('.leak').css('fill-opacity', '0')
        $('.town').css('stroke-opacity', '0')
        $('.point-s').css('opacity', '0')
        $('.road').css('opacity', 1)
        $('.point').attr('r', 0)
        $('#臺灣基督教門諾會醫療財團法人門諾醫院').attr('r', 2)
        $('.country').css('fill-opacity', '')
        $('#花蓮縣').css('fill-opacity', '0.7')
        $('.point').css('fill', '')
        $('.point-s').css('fill', '')
        $('#臺灣基督教門諾會醫療財團法人門諾醫院').css('fill', '#000000')
        $('#馬偕紀念醫院台東分院').css('fill', '')
        $('#六十石山').css('fill', '#000000')
        $('.road').css('stroke-dashoffset', '')
        $('#test').css('stroke-dashoffset', 0)
        $('.svg-text').css('opacity', 0)
        $('.road-text').css('opacity', 0)
        $('.map1').css('opacity', 1)
        this.ext = false
        this.mapMarkHidden2 = true
        $('#map-board-ss').css('opacity', '')
        $('#map-tooltip').css('z-index', '')
        $('#map-say').css('z-index', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-4').offset().top + pagePadding && currentH + window.innerHeight < $('#r-5').offset().top + pagePadding){
        this.mapShow = false
        this.mapScale = true
        this.tooltipShow = false
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-45px'
          this.mapTranslate.y = Number(-76 + transformPadding) + 'px'
        }
        else{
          this.mapTranslate.x = '-45px'
          this.mapTranslate.y = '-180px'
        }
        this.mapSayShow = true
        this.mapmark = '資料來源 Google Map'
        this.mapsay = ''
        this.mapsource = ''
        this.mapremark = ''
        this.mapmenu = false
        $('.leak').css('fill-opacity', '0')
        $('.town').css('stroke-opacity', '0')
        $('.point-s').css('opacity', '0')
        $('.road').css('opacity', 1)
        $('.point').attr('r', 0)
        $('#馬偕紀念醫院台東分院').attr('r', 2)
        $('.country').css('fill-opacity', '')
        $('#臺東縣').css('fill-opacity', '0.7')
        $('.point').css('fill', '')
        $('.point-s').css('fill', '')
        $('#馬偕紀念醫院台東分院').css('fill', '#000000')
        $('#金城武樹').css('fill', '#000000')
        $('.road').css('stroke-dashoffset', '')
        $('#test2').css('stroke-dashoffset', 0)
        $('.svg-text').css('opacity', 0)
        $('.road-text').css('opacity', 0)
        $('.map2').css('opacity', 1)
        this.ext = false
        this.mapMarkHidden2 = true
        $('#map-board-ss').css('opacity', '')
        $('#map-tooltip').css('z-index', '')
        $('#map-say').css('z-index', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-5').offset().top + pagePadding && currentH + window.innerHeight < $('#r-6').offset().top + pagePadding){
        this.mapShow = false
        this.mapScale = true
        this.tooltipShow = false
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '21px'
          this.mapTranslate.y = Number(-140 + transformPadding) + 'px'
        }
        else{
          this.mapTranslate.x = '21px'
          this.mapTranslate.y = '-240px'
        }
        this.mapSayShow = true
        this.mapmark = '資料來源 Google Map'
        this.mapsay = ''
        this.mapsource = ''
        this.mapremark = ''
        this.mapmenu = false  
        $('.leak').css('fill-opacity', '0')
        $('.town').css('stroke-opacity', '0')
        $('.point-s').css('opacity', '0')
        $('.road').css('opacity', 1)
        $('.point').attr('r', 0)
        $('#輔英科技大學附設醫院').attr('r', 2)
        $('.country').css('fill-opacity', '')
        $('#屏東縣').css('fill-opacity', '0.7')
        $('.point').css('fill', '')
        $('.point-s').css('fill', '')
        $('#輔英科技大學附設醫院').css('fill', '#000000')
        $('#墾丁大街').css('fill', '#000000')
        $('.road').css('stroke-dashoffset', '')
        $('#test3').css('stroke-dashoffset', 0)
        $('.svg-text').css('opacity', 0)
        $('.road-text').css('opacity', 0)
        $('.map3').css('opacity', 1)
        $('#臺北市').css('fill', '')
        this.ext = false
        this.mapMarkHidden2 = true
        $('#map-board-ss').css('opacity', '')
        $('#map-tooltip').css('z-index', '')
        $('#map-say').css('z-index', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-6').offset().top + pagePadding && currentH + window.innerHeight < $('#r-7').offset().top + pagePadding){
        this.mapShow = false
        this.mapScale = true
        this.tooltipShow = false
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-103px'
          this.mapTranslate.y = Number(250 + transformPadding) + 'px'
        }
        else{
          this.mapTranslate.x = '-103px'
          this.mapTranslate.y = '140px'
        }    
        this.mapSayShow = true
        this.mapmark = '資料來源 Google Map'
        this.mapsay = ''
        this.mapsource = ''
        this.mapremark = ''
        this.mapmenu = false
        $('.leak').css('fill-opacity', '0')
        $('.town').css('stroke-opacity', '0')
        $('.point-s').css('opacity', '0')
        $('.road').css('opacity', 1)
        $('.point').attr('r', 0)
        $('#國立台灣大學醫學院附設醫院').attr('r', 2)
        $('.country').css('fill-opacity', '')
        $('#臺北市').css('fill', '#EF4326')
        $('#臺北市').css('fill-opacity', '0.7')
        $('.point').css('fill', '')
        $('.point-s').css('fill', '')
        $('#國立台灣大學醫學院附設醫院').css('fill', '#000000')
        $('#大安').css('fill', '#000000')
        $('.road').css('stroke-dashoffset', '')
        $('#test4').css('stroke-dashoffset', 0)
        $('.svg-text').css('opacity', 0)
        $('.road-text').css('opacity', 0)
        $('.map4').css('opacity', 1)
        $('.pharmacy').css('fill-opacity', '')
        this.ext = false
        this.mapMarkHidden2 = true
        $('#map-board-ss').css('opacity', '')
        $('.country').css('pointer-events', '')
        $('#map-say').css('z-index', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-7').offset().top + pagePadding && currentH + window.innerHeight < $('#r-8').offset().top + pagePadding){
        this.mapShow = true
        this.mapScale = false
        this.mapTranslate.x = 0
        this.mapTranslate.y = 0
        this.mapSayShow = true
        this.mapMarkHidden = false
        this.mapmark = '沒有健保藥局鄉鎮市區'
        this.mapcontent = '52鄉鎮沒健保藥局 37萬人受影響'
        this.mapsay = '資料來源：中央健保署健保特約醫療院所查詢系統'
        this.mapsource = '統計時間：2017/12/13'
        this.mapremark = ''
        this.mapmenu = false
        $('.point').attr('r', 0)
        $('.point-s').css('opacity', '0')
        $('.road').css('stroke-dashoffset', '')
        $('.town').css('stroke-opacity', '0.5')
        $('.town').css('fill-opacity', '')
        $('.svg-text').css('opacity', 0)
        $('.road-text').css('opacity', 0)
        $('.pharmacy').css('fill-opacity', '1')
        $('.country').css('fill-opacity', '')
        $('#臺北市').css('fill', '')
        $('.old').css('fill', '')
        this.ext = true
        this.mapMarkHidden2 = true
        $('.circle').css('top', '')
        $('#map-board-ss').css('opacity', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-9').offset().top + pagePadding && currentH + window.innerHeight < $('#r-10').offset().top + pagePadding){
        this.mapShow = true
        this.mapScale = false
        this.mapTranslate.x = 0
        this.mapTranslate.y = 0
        this.mapSayShow = true
        this.mapMarkHidden = false
        this.mapcontent = '15個超高齡鄉鎮 領藥難上加難'
        this.mapmark = '沒有健保藥局鄉鎮市區'
        this.mapsay = '資料來源：內政部戶政司'
        this.mapsource = '統計時間：2017年10月'
        this.mapremark = ''
        this.mapmenu = false
        this.mapmarks = '超高齡鄉鎮（65歲以上老年人口比率超過20%）'
        $('.point').attr('r', 0)
        $('.point-s').css('opacity', '0')
        $('.road').css('stroke-dashoffset', '')
        $('.town').css('stroke-opacity', '0.5')
        $('.town').css('fill-opacity', '')
        $('.pharmacy').css('fill-opacity', '1')
        $('.old').css('fill-opacity', '1')
        $('.old').css('fill', '#630808')
        $('.svg-text').css('opacity', 0)
        $('.country').css('fill-opacity', '')
        this.ext = true
        this.mapMarkHidden2 = false
        $('.circle').css('top', '41px')
        $('#map-board-ss').css('opacity', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight >= $('#r-10').offset().top + pagePadding && currentH + window.innerHeight < $('#r-11').offset().top + pagePadding){
        this.mapShow = true
        this.mapScale = false
        this.mapTranslate.x = 0
        this.mapTranslate.y = 0
        this.mapSelect = false
        this.mapSayShow = true
        this.mapMarkHidden = false
        this.mapcontent = '141鄉鎮缺緊急醫療資源 轉診像賭命'
        this.mapmark = '緊急醫療資源不足地區'
        this.mapsay = '資料來源：衛生福利部'
        this.mapsource = '統計時間：2017年9月'
        this.mapremark = ''
        this.mapmenu = false
        this.tooltipShow2 = false
        $('.point').attr('r', 0)
        $('.point-s').css('opacity', '0')
        $('.road').css('stroke-dashoffset', '')
        $('.town').css('stroke-opacity', '1')
        $('.town').css('fill-opacity', '')
        $('.svg-text').css('opacity', 0)
        $('.leak').css('fill-opacity', '1')
        $('.country').css('fill-opacity', '')
        $('.old').css('fill', '')
        this.ext = true
        this.mapMarkHidden2 = true
        $('.circle').css('top', '')
        $('.circle2').css('background', '')
        $('#map-board-ss').css('opacity', '')
      }

      if(currentH + window.innerHeight/2 >= $('#r-11').offset().top + pagePadding && currentH + window.innerHeight < $('#r-12').offset().top + pagePadding){
        this.mapShow = true
        this.mapSelect = true
        this.mapScale = false
        this.mapScaleBig = false
        this.boardShow = false
        this.mapTranslate.x = 0
        this.mapTranslate.y = 0
        this.part2 = true
        this.mapcontent = '前5名「沙漠」縣市 6成以上鄉鎮區缺安寧資源'
        this.mapSayShow = true
        this.mapMarkHidden = false
        this.mapmark = '沙漠縣市'
        this.mapmarks = '綠洲縣市'
        this.mapsay = '資料來源：衛福部、內政部、記者整理'
        this.mapsource = '統計時間：2017年9月'
        this.mapremark = ''
        $('.circle2').css('background', '#26CAD3')
        $('.town').css('stroke-opacity', '0')
        $('#leave .town').css('stroke-opacity', '1')
        $('.town').css('fill-opacity', '')
        $('.pharmacy').css('fill-opacity', '')
        $('.dessert').css('fill-opacity', '1')
        $('.rich').css('fill-opacity', '1')
        this.ext = false
        this.mapMarkHidden2 = false
        $('.circle').css('top', '22px')
        $('#map-board-ss').css('opacity', '')
        this.tooltipShow2 = false
      }

      if(currentH + window.innerHeight/2 >= $('#r-12').offset().top + pagePadding && currentH + window.innerHeight < $('#r-13').offset().top + pagePadding){
        this.mapShow = false
        this.mapmenu = false
        this.mapScale = false
        this.mapScaleBig = true
        this.boardShow = true
        this.mapSelect = false
        this.mapmark = ''
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-140px'
          this.mapTranslate.y = Number(238 + transformPadding) + 'px'
        }
        else{
          this.mapTranslate.x = '-130px'
          this.mapTranslate.y = '180px'
        }
        this.selectedCountry = this.main[17]
        this.tooltipShow2 = false
        $('.town').css('stroke-opacity', '0')
        $('.town').css('fill-opacity', '')
        $('.pharmacy').css('fill-opacity', '')
        $('.country').css('fill-opacity', '')
        $('.dessert').css('fill-opacity', '1')
        this.ext = false
        $('#dessertNumber').css('color', '')
        this.mapMarkHidden = true
        this.mapMarkHidden2 = true
        $('.circle').css('top', '')
        $('.circle2').css('background', '')
        $('#map-board-ss').css('opacity', '')
      }

      if(currentH + window.innerHeight/2 >= $('#r-13').offset().top + pagePadding && currentH + window.innerHeight < $('#r-14').offset().top + pagePadding){
        this.mapShow = false
        this.mapScale = false
        this.mapScaleBig = true
        this.boardShow = true
        this.mapmark = ''
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-63px'
          this.mapTranslate.y = Number(155 + transformPadding) + 'px'
          $('#map-board-ss').css('opacity', '1')
          this.selectedCountry = this.main[19]
        }
        else{
          this.mapTranslate.x = '-113px'
          this.mapTranslate.y = '172px'
          this.selectedCountry = this.main[1]
        }
        
        $('.country').css('fill-opacity', '')
        $('.rich').css('fill-opacity', '1')
        $('#dessertNumber').css('color', '#26cad3')
        this.ext = false
      }

      if(currentH + window.innerHeight/2 >= $('#r-14').offset().top + pagePadding && currentH + window.innerHeight < $('#r-15').offset().top + pagePadding){
        this.mapShow = false
        this.mapScale = false
        this.mapScaleBig = true
        this.boardShow = true
        this.mapmark = ''
        if(window.innerWidth > 1024){
          this.mapTranslate.x = '-63px'
          this.mapTranslate.y = Number(155 + transformPadding) + 'px'
          $('#map-board-ss').css('opacity', '1')
        }
        else{
          this.mapTranslate.x = '40px'
          this.mapTranslate.y = '-65px'
        }
        this.selectedCountry = this.main[19]
        $('.country').css('fill-opacity', '')
        $('.rich').css('fill-opacity', '1')
        $('#dessertNumber').css('color', '#26cad3')
        this.ext = false
      }
     
    },
    expand: function(){
      this.mapmenu = !this.mapmenu
    }
  },
  components: {
    Indicator, HeadBar, Cover, ContentContainer, Quote, Section, Share, Editor, Relate, FBComment, Foot, Logo, Question
  }
}
</script>

<style>

#refer{
  color: #EF4326;
  border-bottom: 2px solid #EF4326;
  display: inline-block;
}

#leave{
  width: 79px;
  height: 71px;
  position: absolute;
  top: 130px;
  left: 30px;
  opacity: 0;
}

#leave.show{
  opacity: 1;
}

.title-button{
  font-size: 50px;
  width: 50px;
  height: 50px;
  margin: auto;
}

.st0{fill:#FFFFFF;stroke:#B5B5B6;stroke-width:0.25;stroke-miterlimit:10;}
.st1{fill:none;stroke:#5B5A5A;stroke-width:0.3;stroke-miterlimit:10;}

html, body, #app{
  height: 100%;
}

svg{
  width: 100%;
}

.img-contain img{
  width: 100%;
}

.doctor{
  font-size: 26px;
  text-align: center;
  font-weight: bold;
  position: relative;
}

.doctor-text{
  position: relative;
}

.doctor-underline{
  width: 0px;
  height: 10px;
  position: absolute;
  top: 25px;
  z-index: 0;
  left: 50%;
  background: #EF4326;
  margin-left: -120px;
  transition: all 0.7s ease;
}

.doctor-underline.max{
  width: 240px;
}

.people{
  height: 100px;
}

.people-img{
  width: 100px;
  height: 100px;
  float: left;
}

.people-name{
  height: 100px;
  padding-left: 120px;
  padding-top: 35px;
  border-bottom: 1px solid #B5B5B5;
}

.rich{
  fill: #26CAD3;
}

.dessert{
  fill: #EF4326;
}

.number{
  font-size: 26px;
  color: #EF4326;
  font-weight: bold;
}

.town.leak{
 fill: #EF4326;
}

.town.pharmacy{
  fill: #EF4326;
}

#dibow{
  transform: translate(15px, 2px);
}

.svg-text{
  font-size: 6px;
  text-anchor: end;
  transform: translate(-6px, 2px);
  transition: all 0.7s ease;
  opacity: 0;
}

.road-text{
  font-size: 8px;
  text-anchor: end;
  transition: all 0.7s ease;
  opacity: 0;
}

#test{
  stroke-dasharray: 134.19932556152344;
  stroke-dashoffset: 134.19932556152344;
}

#test2{
  stroke-dasharray: 66.69547271728516;
  stroke-dashoffset: 66.69547271728516;
}

#test3{
  stroke-dasharray: 97.28009033203125;
  stroke-dashoffset: 97.28009033203125;
}

.road{
  fill:none;
  stroke:#000000;
  stroke-width: 1.5;
  transition: all 0.7s ease;
  opacity: 0;
}

.space{
  height: 100%;
}

.point{
  stroke-width: 0.5;
  fill: #EF4326;
  fill-opacity: 0.8;
}

.point-s{
  stroke-width: 0.5;
  fill: #EF4326;
  opacity: 0;
}

.town{
  fill: #FFFFFF;
  fill-opacity: 0;
  stroke: #B5B5B6;
  stroke-opacity: 0;
  stroke-width: 0.25;
  transition: all 0.7s ease;
}

.textbox{
  padding: 30px 20px;
  color: #4D4D4D;
  font-size: 18px;
  box-shadow: -2.8px 1.1px 7px 0 rgba(0, 0, 0, 0.1);
  background-color: #FFFFFF;
}

#cover #cover-contain{
  position: absolute;
  left: 20px;
  top: 38%;
  right: 20px;
  text-shadow: none;
}

#cover h1{
  color: #010101;
  text-shadow: none;
}

#cover-text{
  color: #4D4D4D;
  font-size: 18px;
  line-height: 32px;
}

#cover-icon{
  width: 140px;
  position: absolute;
  right: 20px;
  top: 10%;
}

#map-contain{
  overflow: hidden;
  position: relative;
  height: 100%;
}

#svg-contain{
  overflow: hidden;
  position: relative;
  width: 375px;
  height: 667px;
  position: fixed;
  top: 0;
  left: 0;
  z-index: -2;
  transition: all 0.7s ease;
}

#map{
  transition: all 0.7s ease;
}

.zoomIn{
  transform: scale(2.5);
}

.zoomInBig{
  transform: scale(5);
}

.country{
  transition: all 0.7s ease;
}

.circle{
  width: 7px;
  height: 7px;
  display: inline-block;
  position: absolute;
  top: 5px;
  left: 0;
  border-radius: 50%;
  background-color: #EF4326;
}

.circle2{
  width: 7px;
  height: 7px;
  display: inline-block;
  position: absolute;
  top: 5px;
  left: 0;
  border-radius: 50%;
  background-color: #630808;
}

#map-say{
  position: fixed;
  width: 160px;
  text-align: left;
  left: 20px;
  bottom: 10px;
  font-size: 11px;
  color: #A4A2A2;
  padding-left: 10px;
  transition: opacity 0.7s ease;
  opacity: 0;
  z-index: -1;
}

#map-say.show{
  opacity: 1;
}

#map-content{
  top: -3%;
  z-index: -1;
  position: fixed;
  transition: opacity 0.7s ease;
  opacity: 0;
}

#map-content.show{
  opacity: 1;
}

#map-menu{
  position: fixed;
  width: 156px;
  background-color: #F4F2F2;
  padding: 18px;
  padding-bottom: 70px;
  top: 90px;
  transition: all 0.7s ease;
  transform: translate(-100%, 0);
  height: 600px;
  overflow: scroll;
  z-index: 10;
}

#map-menu.open{
  transform: translate(0, 0);
}

.item{
  font-size: 15px;
  width: 120px;
  line-height: 37px;
  height: 37px;
  color: #828282;
  text-align: center;
}

.item.selected{
  background-color: #F15A24;
  color: #FFFEFE;
}

#map-select{
  position: fixed;
  width: 110px;
  height: 28px;
  left: 20px;
  top: 140px;
  border-bottom: 1px solid #AAAAAA;
  font-size: 15px;
  color: #EF4326;
  transition: all 0.7s ease;
  background-color: #FFFFFF;
  z-index: 9;
  opacity: 0;
}

#map-select.open{
  border: none;
  transform: translate(136px, 0)
}

#map-select.open span{
  display: none;
}

#map-select img{
  width: 28px;
  margin-top: -5px;
}

#map-tooltip{
  position: fixed;
  width: 260px;
  height: 215px;
  background-image: url('./assets/tooltips.png');
  background-repeat: no-repeat;
  background-size: 260px 215px;
  bottom: 75px;
  right: 10px;
  padding: 20px;
  opacity: 0;
  transition: opacity 0.7s ease;
  z-index: -1;
}

#map-tooltip.show{
  opacity: 1;
}

#map-tooltip-s{
  position: fixed;
  width: 260px;
  height: 190px;
  background-image: url('./assets/tooltips.png');
  background-repeat: no-repeat;
  background-size: 260px 190px;
  bottom: 75px;
  right: 10px;
  padding: 20px;
  opacity: 0;
  transition: opacity 0.7s ease;
  z-index: -1;
}

#map-tooltip-s.show{
  opacity: 1;
}

.tooltip-title{
  font-size: 18px;
  font-weight: bold;
  color: #4D4D4D;
  line-height: 1;
  margin-top: 5px;
}

#tooltip-detail{
  border-top: 1px solid #000000;
  margin-top: 7px;
  padding-top: 3px;
}

#tooltip-detail-s{
  border-top: 1px solid #000000;
  margin-top: 7px;
  padding-top: 3px;
}

#map-board{
  position: fixed;
  width: 300px;
  left: 50%;
  margin-left: -150px;
  bottom: 20%;
  height: 215px;
  background: white;
  padding: 20px;
  opacity: 0;
  transition: all 0.7s ease;
  z-index: -1;
}

#map-board.show{
  opacity: 1;
}

#map-board-s{
  position: fixed;
  width: 300px;
  left: 50%;
  margin-left: -150px;
  bottom: 20%;
  height: 215px;
  background: white;
  padding: 20px;
  opacity: 0;
  transition: all 0.7s ease;
  z-index: -1;
}

#board-title-s{
  font-weight: bold;
  font-size: 26px;
  color: #4D4D4D;
}

#map-board-ss{
  position: fixed;
  width: 300px;
  left: 30%;
  bottom: 47%;
  height: 215px;
  background: white;
  padding: 20px;
  opacity: 0;
  transition: all 0.7s ease;
  z-index: -1;
}

#board-title-ss{
  font-weight: bold;
  font-size: 26px;
  color: #4D4D4D;
}

#board-title{
  font-weight: bold;
  font-size: 26px;
  color: #4D4D4D;
}

#board-text-s{
  margin-top: 10px;
}

#dessertNumber{
  font-size: 40px;
}

#dessertNumber2{
  font-size: 40px;
  color: #26cad3;
}

.board-text{
  font-size: 18px;
  color: #4D4D4D;
  line-height: 32px;
}

.board-text span{
  position: absolute;
  right: 19px;
}

#board-text-s span{
  position: absolute;
  right: 19px;
}

.detail{
  height: 30px;
  line-height: 30px;
  font-size: 13px;
  color: #4D4D4D;
  border-bottom: 1px solid #AAAAAA;
}

.detail.noborder{
  border: none;
}

.detail span{
  position: absolute;
  right: 19px;
  color: #F15A24;
}

#map-select.show{
  opacity: 1;
}

.textbox h2{
  font-weight: bold;
  font-size: 26px;
}

#draw-1 img{
  width: 100%;
}

@media screen and (min-width: 1024px){
  
  .people-name{
    border-bottom: none;
  }
  .textbox h2{
    font-size: 30px;
  }
  .space{
    /* height: 0; */
  }
  .textbox{
    height: 100vh;
    width: 440px;
    position: absolute;
    right: 20%;
    box-shadow: none;
  }
  svg{
    width: auto;
  }
  #svg-contain{
    left: 20%;
    top: 150px;
    height: 100%;
  }
  #map-board-s{
    left: 30%;
    margin-left: 0;
  }
  #map-board{
    left: 30%;
    margin-left: 0;
  }
  .zoomInBig{
    transform: scale(2.5)
  }
  #map-say{
    left: 3%;
    bottom: 3%;
  }
  .space-s{
    height: 100vh;
  }
  #r-15{
    height: 0;
  }
  #map-tooltip{
    left: 30%;
  }
  #map-tooltip-s{
    left: 30%;
  }
  #map-select{
    left: 3%;
  }
  #cover-icon {
    width: 200px;
    left: 11%;
    transform: scale(-1, 1);
  }
  #cover #cover-contain{
    width: 700px;
    left: 17%;
    top: 30%;
  }
}

@media screen and (min-width: 1280px) and (max-height: 900px){
  #svg-contain{
    left: 10%;
    top: 50px;
  }
  #map-tooltip{
    left: 23%;
  }
  #map-tooltip-s{
    left: 23%;
  }
  #map-board-s{
    bottom: 10%;
    left: 20%;
  }
  #map-board {
    bottom: 10%;
    left: 20%;
  }
  #map-board-ss{
    bottom: 41%;
    left: 20%;
  }
}

</style>
